{"data":{"markdownRemark":{"html":"<p>Greetings to this book which will guide you through important bits of the technology that enables the spaceship SAITRON to be a dangerous opponent, a fast traveller and a protector against the perils of intergalactic doing.</p>\n<p>The SAITRON is a ship that was jointly thought through by me and Andre Heimann. Well, we rather thought about the ship's activity and its setting, being the strongest ship to date built by a splinter group of the mighty race of the Ii. The shape of the ship has been captured about 5 years ago with the aid of\n<a href=\"http://www.rhino3d.com/\">Rhino3D</a>. </p>\n<p>I have briefly documented the <a href=\"/2006/06/07/saitron-in-visuals\">evolution of the 3D model here</a>.</p>\n<p>This guide, however, focusses on the technology that makes SAITRON tick. It is written from the point of view of the major branch of the Ii race, the swarm surrounding the unique space-arch DAUGHTER OF YHSUU, i.e. on a level of technical expertise that is somewhat beyond the aforementioned splinter group. Even so, the development of the SAITRON achieves the level of standard expected from typical swarm ships, such that the information presented here is indeed quite relevant to the SAITRON.</p>\n<p>As it happens to be with a good part of Sci-Fi, there is a bit of Science, and a lot of Fiction. The reality hooks provided in this book are related to some other work of mine, which is yet to be published, quite a bit of inspiration and imagination and <em>loads of fun</em>! Either way, it provides a view on a technology you may not have encountered yet. </p>\n<p>Whatever will come, I hope you'll enjoy it! </p>","fields":{"slug":"/2006/06/07/the-technology-behind-the-saitron"},"frontmatter":{"date":"June 07, 2006","path":null,"title":"The Technology behind the SAITRON","tags":["sci-fi"]}}},"pageContext":{"title":"The Technology behind the SAITRON","previous":{"fields":{"slug":"/2006/06/07/saitron-in-visuals","published":true},"frontmatter":{"title":"SAITRON in visuals","tags":["sci-fi"],"date":"2006/06/07"}},"next":{"fields":{"slug":"/2006/06/09/groundwork","published":true},"frontmatter":{"title":"Groundwork","tags":["sci-fi"],"date":"2006/06/09"}}}}