{"data":{"markdownRemark":{"html":"<p>It has been itching for a while now. I may love .NET, but every once in a while I need to escape into something else. Primordial soups of programming, dynamic chaos...well, ok, I am exaggerating, I wasn't doing <a href=\"http://www.madore.org/~david/programs/unlambda/\">unlambda</a>, just javascript.</p>\n<p>Arguably, javascript may be the most abused language out there, with millions of unknowing folks falling over it and torturing it until...</p>\n<p><img src=\"/assets/unresponsive.jpg\"></p>\n<p>Sometimes people are also quite brutal. They teach him <a href=\"http://www.asp.net/ajax/documentation/live/tutorials/EnhancingJavaScriptTutorial.aspx\">all sorts of tricks</a> like interfaces, namespaces, private and public members...Probably quite useful and all but for many applications outrageously complicated.</p>\n<p>You know, javascript is a bit like a grandfather. He plays with your grandchildren, and they're having fun and all, but he's actually a kind, intelligent and cunning person, too, with whom you can have excellent and deep conversations. Provided you use a <a href=\"http://jquery.com/\">nice framework</a> that does not get in the way and you realize that Javascript is the poor man's functional programming language of choice, you're off writing cool stuff in few lines of code.</p>\n<p>Let me talk through the example with which I satisfied my longing for some functional mayhem. <a href=\"/assets/ValidationTest.htm\">You can have a look at it here</a>. It is basically a nano-framework,quite incomplete, to express client-side validation of HTML form fields in a very unobtrusive fashion.</p>\n<p>What is this unobtrusive java scripting anyway? It all boils down to separation of concerns again. The HTML structures your document, much like xml. Interspersing it with funny javascript calls (like onclick=\"dofunkyStuff(1, '23')\") is not necessarily your friend when it comes down to maintaining your page. Meanwhile most people seem to have grasped the idea of separating structure and styling with the aid of CSS. While in HTML you still tend to have a reference to your CSS, you can inject your programmable logic without any notion of javascript in your HTML code.</p>\n<p>The idea is simple. I add some metadata to the HTML which I can find once the DOM is fully setup on the client-side.</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">&lt;input type=&quot;text&quot; validation=&quot;numeric&quot; &gt;\n&lt;input type=&quot;text&quot; validation=&quot;/cool/i&quot; &gt;</code></pre></div>\n<p>The validation attribute is not part of the known HTML attributes, but it is part of the DOM accessible by javascript. I am not sure how people's opinion is on doing this sort of thing, but from a functional perspective it works pretty well. If you feel this is slightly hackish you could write your document as XHTML, add a new XML-namespace and use elements of that namespace in your document:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">&lt;html xmlns=&quot;http://www.w3.org/1999/xhtml&quot; xmlns:rf=&quot;http://rf.scripting/validation&quot;&gt;\n...\n&lt;rf:validation type=&quot;numeric&quot;&gt;\n  &lt;input type=&quot;text&quot; /&gt;\n&lt;/rf:validation&gt;</code></pre></div>\n<p>Since all javascript that would be hacked right into HTML reacts to events probably triggered by the page's user, I may as well attach the event handlers after the DOM has loaded and before the user interacts with it. The jQuery library allows us to do the outlined things quite easily. jQuery provides the <strong>ready</strong> function to which you can pass a function that is called at the right moment. This is a perfect hook to attach your javascript in said unobtrusive fashion:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">validator = new Validation(errorFeedback,passFeedback);\n$(document).ready(validator.setup);</code></pre></div>\n<p>validator is the \"instance\" of the <em>Validation</em> function which we'll look at later. Its constructor would like two arguments: functions that will be called either when an input field passes validation or when it fails. Here we also have separation of concerns: The validation system has nothing to do with the display of possible validation failures, so we provide it with the means to display or remove visual cues about the error. In this example, these are the functions:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">function errorFeedback(element,msg) {\n\t$(element).removeClass(&quot;ok&quot;).addClass(&quot;error&quot;).attr(&quot;title&quot;,msg);\n}\n\nfunction passFeedback(element) {\n\t$(element).removeClass(&quot;error&quot;).addClass(&quot;ok&quot;).removeAttr(&quot;title&quot;);\n}</code></pre></div>\n<p>Here, jQuery helps to streamline the necessary DOM modifications to display/clear an error.</p>\n<p>Back to the validator. We passed something called setup to the ready function. Let us have a look:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">function Validation(errorStyler,passStyler) {\n\n  validationFeedBack.errorFeedbackFunc = errorStyler;\n  validationFeedBack.passFeedbackFunc = passStyler;\n\n  this.setup = function() {\n    $(&quot;input[type=&#39;text&#39;][validation]&quot;).each(function(idx) {\n      $(this).blur(\n        new Validation.validatorCallBack(Validation.returnValidator(this))\n      );\n    });\n  }\n}</code></pre></div>\n<p>One can see that setup is a function itself. As it does not really refer to its outside scope (seeing that <em>setup _is an inner function of _validation</em>) it could be outside. In fact, setup cannot easily refer to this scope because the \"this\" keyword will refer to an altogether different scope once things get actually called.</p>\n<p>So what <strong>setup</strong> does is to iterate over all input fields with a validation attribute and attach to the <code class=\"language-text\">onblur</code> event of every such element a function. It will be called in the context of an input field once it gets blurred. Inside the each-block \"this\" refers to said element (jQuery ensures that).</p>\n<p>We know that <strong>blur</strong> necessitates a function, let's then look at what is called in turn. First the <code class=\"language-text\">returnValidator</code>-call:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">Validation.returnValidator = function(inspectedElement) {\n  var identifier = $(inspectedElement).attr(&quot;validation&quot;)\n  if (identifier == &#39;numeric&#39;)\n    return Validation.numericValidator;\n  else if (identifier.substr(0,1) == &#39;/&#39;)\n    return Validation.regexValidator;\n  else\n    return Validation.nullCallback;\n}</code></pre></div>\n<p>Here we have a hard-coded interpretation of what is contained in the validation attribute of the inspected input field. One could think of some approach using eval, but even though I'm no expert in hacking into a javascript application it sounds to me like this would be open to abuse by using some tool in your browser to change the contents of the attribute to whatever you like. The <code class=\"language-text\">returnValidator</code> therefore returns functions. They fit to the desired type of validation. Here are those implemented in the example:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">Validation.numericValidator = function(inputElement) {\n  if (isNaN(inputElement.value))\n    throw &quot;Input is not a number&quot;;\n}\n\nValidation.regexValidator = function(inputElement){\n  var regexstring = $(inputElement).attr(&quot;validation&quot;);\n  var re = eval(regexstring);\n  if (!re.test(inputElement.value))\n    throw &quot;Field failed to match pattern &quot; + regexstring;\n}\n\nValidation.nullCallback = function(inputElement) {\n  // Unrecognized validation\n}</code></pre></div>\n<p>The setup implementation now obtained a validation function, but it does some more. It wraps it into a call to   <code class=\"language-text\">Validation.validatorCallBack</code>, whose implementation looks like this:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">Validation.validatorCallBack = function(validatorFunc) {\n  var valFunc = validatorFunc;\n\n  return function(eventObj){\n    try {\n      valFunc(this);\n      validationFeedBack.passFeedbackFunc(this);\n    }\n    catch (x) {\n      validationFeedBack.errorFeedbackFunc(this,x);\n    }\n  }\n}</code></pre></div>\n<p>Here I make use of a closure. We return once more a function that is defined in the scope of an outer function. Once that inner function is called (when the input field blurs) it will be able to refer to values defined in said scope. That way we can actually remember the validation function and call it once the <code class=\"language-text\">validatorCallback</code> return function is called. If you think I've written the word function too much, don't worry, it'll probably pass after a while.</p>\n<p>I would not deem myself an expert in javascript - even so I hope you get the feeling that javascript works nicely with functions and the notion of closures and that writing unobtrusive javascript is actually quite fun.</p>","fields":{"slug":"/2008/01/30/javascript-ftw-or-whats-this-anyway"},"frontmatter":{"date":"January 30, 2008","path":null,"title":"Javascript FTW or what's 'this' anyway?","tags":["software-development","javascript"]}}},"pageContext":{"title":"Javascript FTW or what's 'this' anyway?","previous":{"fields":{"slug":"/2008/01/30/the-no-frills-bare-bones-example-to-duplex-wcf","published":true},"frontmatter":{"title":"The no frills, bare-bones example to Duplex WCF","tags":["download","dotnet","libs-and-frameworks"],"date":"2008/01/30"}},"next":{"fields":{"slug":"/2008/02/25/evolutions-intelligence","published":true},"frontmatter":{"title":"Evolution's intelligence","tags":["hesitan-and-miracles","biology"],"date":"2008/02/25"}}}}