{"data":{"markdownRemark":{"html":"<p>Bonkers. Crap. Shite. We have spent the last 12 hours fishing containers escaping from the Limelight's portside. Don't ask. Right, you can't, you're just a diary. I am supposed to tell you.</p>\n<p>Compartment  10 was vacuum'd, after which I opened the lock, just to be on the safe side. Unfortunately there was a clear misunderstanding between Comp's knowledge of where the hatches are located and their actual physical location. When I opened compartment 12's lock I (and to my defense Comp, too) wasn't aware that the same lock works for compartment 13 and 14. These, of course, still contained air. Since locks these days open pretty darn quick (you know, Pseudomaterial locks) in that they simply disappear, the air could also 'simply' dissappear, thereby taking with it about 100 Standard containers. I don't know who looked more stupid, me or Piet. Or the darn Engineer. He's a Frognas, Gordon Bennett. If I'd know how crap my race programs Meta-Computers, I would never EVER fly again in a ship built by my own race. It's that stupid Frognas codex again, I s'pose. Trust above death. Psycho-Turd squared. </p>\n<p>After a few seconds Piet noted that if the geezer was indeed in one of the coffins, he might as well stay there since the catastrophes on this ship are likely to kill him.</p>\n<p>With the crane beam we were able to  move most of the containers back in in a fair amount of time. We have sustained some damage to the energy connectors of compartment 13, they didn't take too well the sudden tear-off of the piles' bottom containers. It caused a minor short-circuit. Maintenance units have been on it and it's all working within parameters (HA!). Checked up with Comp that such a discrepancy between sensor world and reality may well kill just as quick as a failing pathway tracker in mid-Meta-Session (because this is exactly what could happen amongst other things). I think she might have understood. </p>\n<p>The remaining twenty-odd containers had to be caught 'by hand' with one of the shuttles, as they had already escaped the effect range of the crane beam. Now we are all pretty knackered and no bit wiser than before regarding a possible blind passager who is also a sought after criminal. At least we haven't lost any of the containers and all linked back into the surveillance net. All contents appear to have taken no damage. I am a lucky boy. Not. </p>\n<p><strike>I ordered Fritiu to hack the containers' processors and modify the recordings of the last 12 hours (What, criptography? You will ALWAYS be able to change a recording of the past, c'mon).</strike></p>\n<p>I will also ask if Piet has some more of that Schnaps. Or I may consult Stinky Fluff.</p>\n<p> </p>","fields":{"slug":"/2006/07/24/-log-entry-2711-07-16"},"frontmatter":{"date":"July 24, 2006","path":null,"title":" Log Entry 2711.07.16","tags":["sci-fi"]}}},"pageContext":{"title":" Log Entry 2711.07.16","previous":{"fields":{"slug":"/2006/07/24/unit-testing-events-with-anonymous-delegates"},"frontmatter":{"title":"Unit testing events with anonymous delegates","tags":["software-development","dotnet"],"date":"2006/07/24"}},"next":{"fields":{"slug":"/2006/08/04/easy-to-be-forgotten-in-the-history-of-science"},"frontmatter":{"title":"Easy to be forgotten in the history of science","tags":["physics","loosely-coupled"],"date":"2006/08/04"}}}}