{"data":{"markdownRemark":{"html":"<p><em>Why all the work</em>? </p>\n<p>Why switching to a new site generator? </p>\n<p>Is it all just an elaborate strategy for some cultivated procrastination? </p>\n<p>This is the amount of posts that I've written since 2004.</p>\n<p><img src=\"/assets/posts-over-years.png\" alt=\"posts per year\"></p>\n<p>I was considering doing some spin doctoring on how things are going downhill, and maybe <em>they are</em>! </p>\n<p>One unfortunate side-effect of crossing my <strong>30ies</strong> and then my <strong>40ies</strong> is that I think a lot more about where to put my energy. There is my family, and there is responsibility. There is very focused product development and then there is that thing that I've written a lot about programming in the previous years, but these days it is <em>also</em> interesting to think about different things - about how software is developed, and on a grander scale, about where we as a whole are going. </p>\n<p>In terms of developing a product, the technical side of things isn't incredibly exciting (or maybe we like to keep it that way) - boring decisions and simple programming is a <strong>good thing</strong> these days. I am not striving for the latest and greatest. I want code to look simple, and boring. If I search for an item, I want to find all occurrences of it. If I have to choose between boilerplate and magic, these days it's for boilerplate, hands down. This is hardly interesting material and has been written a lot about. It's probably a thing about maturity.</p>\n<p>I like to compare this journey to the journey of a musician.  You spend many years honing your skills. You want to play fast, clear, crisp, you learn the mechanics, you play <em>dense</em>, you <em>go for it</em>. With maturity comes a renewed sense for what those skills are actually there for. To have a way to communicate the value, the music </p>\n<p>So, am I done? through?</p>\n<p>I hope not. The questions that go though my mind are often different now:</p>\n<ul>\n<li>Development is about people. People <em>write</em> the code, people <em>read</em> the code, people <em>maintain</em> the code.</li>\n<li>How do you scale a small, professional team to a bigger, still professional team?</li>\n<li>How can you play out the individual strengths of people while maintaining a team effort?</li>\n</ul>\n<p>And then there are the things beyond my work bubble that are currently dominating my mind...</p>\n<ul>\n<li>How can a single child learn best about empathy?</li>\n<li>With what can we replace capitalism?</li>\n</ul>","frontmatter":{"date":"January 01, 2019","path":null,"title":"Clumsy steps towards writing again","tags":["loosely-coupled","meta"]}}},"pageContext":{"title":"Clumsy steps towards writing again","previous":{"fields":{"slug":"/2018/12/30/from-jekyll-to-gatsby"},"frontmatter":{"title":"From Jekyll to Gatsby","tags":["meta","web"],"date":"2018/12/30"}},"next":null}}