{"data":{"markdownRemark":{"html":"<p>Fair enough, production code is unlikely to be running in a cute .NET Console App, but maybe you come into a situation where you at least want to prevent somebody from closing your console window without going through your lovely cleanup routines. This <a href=\"http://www.msnewsgroups.net/group/microsoft.public.dotnet.languages.csharp/topic10229.aspx\">link here</a> will tell you what you can do.</p>\n<p>To spread the word and to have a slightly less wordy version (using e.g. already defined delegates), you may also just look here (or in <a href=\"https://stackoverflow.com/a/474743/51428\">Stackoverflow</a>):</p>\n<pre><code class=\"language-csharp\">[DllImport(\"Kernel32\")]\nprivate static extern bool SetConsoleCtrlHandler(\n    Func&#x3C;CtrlType, bool> handler, \n    bool add);\n\nenum CtrlType\n{\n    CTRL_C_EVENT = 0,\n    CTRL_BREAK_EVENT = 1,\n    CTRL_CLOSE_EVENT = 2,\n    CTRL_LOGOFF_EVENT = 5,\n    CTRL_SHUTDOWN_EVENT = 6\n}\n\nprivate static bool Handler(CtrlType sig)\n{\n    if (sig == CtrlType.CTRL_CLOSE_EVENT)\n            //DoCleanup stuff here\n    return false;\n}\n\nstatic void Main(string[] args)\n{\n    // Some boilerplate to react to close window event\n    SetConsoleCtrlHandler(Handler, true);\n    ....\n</code></pre>\n<p>\"Handler\" is just interested in the close event. It returns a boolean that states whether the given <em>Close</em>-message is handled. If you e.g. are letting your Console App hang around with <em>Console.ReadLine()</em> you better return that the event is not handled yet. That way, whatever routines are in place from .NET to handle the blocking <em>Console</em>-call will also be executed. If you would set handled = true, your App is essentially locked and Windows will ask you to end the process.</p>","frontmatter":{"date":"March 31, 2008","path":null,"title":"Someone closes your console, stopping you from doing any cleanup?","tags":["dotnet"]}}},"pageContext":{"title":"Someone closes your console, stopping you from doing any cleanup?"}}