{"data":{"markdownRemark":{"html":"<p>Putting my website on github through the process of creating a static website based on <a href=\"http://jekyllrb.com\">jekyll</a> marks the 9th version of my online presence.\n10th would have been better to justify a little retrospective, but then I never considered myself a numerologist.</p>\n<h2>The first. 1997.</h2>\n<p>Interestingly the site already contained a component of slapping on a date + title as a headline, accompanied by some content. I'm sure quite a few people did it that way, someone just decided to give it a name at some point: blog. That's how it goes with humans. Business is just a natural extension of what we like to do. I wish we could be relaxed about it at some point.</p>\n<p><img src=\"/assets/site1-1997.png\" alt=\"Website One\"></p>\n<p>The design is definitely very nineties. It's interesting how all images look pretty blurry, but back then it looked pretty crisp. I guess that's the price you pay for retina, the past starts to look ugly. I like the fact that the little javascript snippets (hover over images, counter) work to this very day.</p>\n<h2>1999</h2>\n<p>Apparently I had too much time on my hands and I thought, <em>for maintainability reasons, wouldn't it make sense to have all common layouting elements like colours, or sections, be encoded in javascript? That surely would lead to a more maintainable and flexible website?</em>. A new site was born, where everything was described in javascript. Considering that CSS was already around, this is a classic case of a bad technology choice for the problem at hand.</p>\n<p><img src=\"/assets/site2-1999.png\" alt=\"Website Two\"></p>\n<h2>2000 - CGI.</h2>\n<p>This was a page on <a href=\"https://www.virtualave.net\">virtualave</a> that allowed free hosting while being able to use some cgi stuff, includes in the html and the like. Fancy stuff, sadly I cannot generate a screenshot of that one anymore ;)</p>\n<h2>2001 - The first page under realfiction.net</h2>\n<p>Around 2000-2001 I finally bought realfiction.net and installed my first website, which, if I remember correctly, I maintained with Dreamweaver. This had no blog-style concept but was more like a personal website with things I deemed presentable to a small (<em>possibly very small</em>) audience.</p>\n<p><img src=\"/assets/site3-2001.png\" alt=\"Website Four\"></p>\n<p>I had that page for quite some time, with only small variations.</p>\n<p><img src=\"/assets/site4-2005.png\" alt=\"Website Four\">\n<img src=\"/assets/site5-2006.png\" alt=\"Website Five\"></p>\n<p>As you can see, the latest instalment of the static website had a link to a <em>\"weblog\"</em>, which pointed to a Drupal-Installation.</p>\n<h2>2005,2006 - Drupal-based page</h2>\n<p>Around this time I really started to create <em>some</em> content for my website, and I decided to have everything running on the <a href=\"https://www.drupal.org\">CMS Drupal</a> (as my web provider would allow running PHP and MySQL). I reckon that the final switch to everything running on Drupal coincides with this <a href=\"/2006/05/27/a-warm-welcome!\">post here</a>.</p>\n<h2>2009 - Custom-made website</h2>\n<p>With my skills growing in SW development, I felt the need to stay in the game with web technologies as my daytime programming was pretty thick client-heavy. Still my roots were in the .NET tech stack, hence I was looking to find a hosting provider which would allow me to run .NET, which I found in <a href=\"http://www.winhost.com\">WinHost</a>. Also, I wanted to use git, as it was all the rage - <a href=\"https://github.com/flq/Rf.Sites/commit/95bac01dabc9f34379687d2de52177c42d019dc2\">My first commit</a> for this website is dated Oct 10, 2009.</p>\n<p><img src=\"/assets/site6-2011.png\" alt=\"Website Four\"></p>\n<p>The first version of this site was based on NHibernate + FluentNHibernate and ASP.NET MVC. Some 2 years later I switch to the (know unfortunately defunct) <a href=\"http://mvc.fubu-project.org\">FubuMVC</a>. The last incarnation allowed to <a href=\"/2013/03/24/a-new-beginning\">drop markdown into a dropbox folder</a> which the website would pick up and publish. Not too bad, but somehow I am once more in a phase were I want to reduce any maintenance burden there is for my website. </p>\n<h2>2014 - Jekyll on github</h2>\n<p>The github pages striked me as a viable option to keep writing markdown, with pushing as easy as writing <em>git push</em>. </p>\n<p>And there I am, looking back at 17 years of personal web pages. A myriad ways to the same conclusion: Sending a web page to a browser.</p>\n<p><em>Still liking it!</em></p>","fields":{"slug":"/2014/10/15/the-one-where-all-the-stuff-is-put-on-github"},"frontmatter":{"date":"October 15, 2014","path":null,"title":"The one where all the stuff is put on github","tags":["meta"]}}},"pageContext":{"title":"The one where all the stuff is put on github","previous":{"fields":{"slug":"/2014/02/22/fixie-and-resharper-smooth-sailing-on-the-agenda","published":true},"frontmatter":{"title":"fixie and resharper, smooth sailing on the Agenda.","tags":["dotnet","programming"],"date":"2014/02/22"}},"next":{"fields":{"slug":"/2014/10/20/lexing-and-parsing-in-f","published":true},"frontmatter":{"title":"Lexing and parsing in F#","tags":["programming","fsharp"],"date":"2014/10/20"}}}}