{"data":{"markdownRemark":{"html":"<p>Fubumvc not only allows you to define your own conventions, i.e. the ways in which your code gets wired up into your web app,\nit comes with its own set of conventions. Before you start re-inventing some wheels, check out what the framework has up its sleeve.</p>\n<p>When you like checking out the source code, the bootstrapping of <em>in-built</em> conventions is found in the <a href=\"https://github.com/DarthFubuMVC/fubumvc/blob/master/src/FubuMVC.Core/FubuRegistry.DefaultConventions.cs\">FubuRegistry</a>.</p>\n<p>Without further ado, let us list it:</p>\n<ul>\n<li>If you mark an action with the <em>HtmlEndpointAttribute</em>, the model returned will be rendered as HTML by calling <em>ToString()</em> on the model.</li>\n<li>If you return a string from an action and the action's method name end on <strong>Html</strong>, it will be used as the response assuming it is HTML.</li>\n<li>If you return a string <strong>without</strong> having the action name end on HTML, it will be rendered out with MIME-type <em>text/plain</em>.</li>\n<li>When your output model implements the interface <em>JsonMessage</em>, it will be rendered out as Json.</li>\n<li>When you like using the API from the <a href=\"http://htmltags.fubu-project.org/\">HtmlTags library</a>, you can output either a <em>HtmlDocument</em> or <em>HtmlTag</em> from your action and it will be output as HTML.</li>\n<li>When your action outputs a value from the <a href=\"http://msdn.microsoft.com/en-us/library/system.net.httpstatuscode.aspx\">System.Net.HttpStatusCode</a>, Fubumvc ensures that the code is used as response status code.</li>\n<li>Your actions can cause a redirect / transfer to a different Url/Action. This happens either by returning a <em>FubuContinuation</em> or a model implementing <em>IRedirectable</em>.</li>\n<li>If your output model implements <em>IHaveHeaders</em>, you can provide a collection of header values which will be added as HTTP Header to the response.</li>\n</ul>\n<p>There are a couple of other conventions in a number of areas, however, I haven't followed the underlying code enough to be able to write down a summary. Even so,\nI hope that knowledge about the conventions above helps you in writing less code.</p>","frontmatter":{"date":"November 27, 2011","path":null,"title":"In-built conventions in Fubumvc","tags":["software-development","dotnet","web","libs-and-frameworks"]}}},"pageContext":{"title":"In-built conventions in Fubumvc"}}