{"data":{"markdownRemark":{"html":"<p>The major ingredients to the reality model used by Ii Scientists and Engineers alike are short in number and relatively easy to understand.</p>\n<p><strong>Definition Space</strong>: Consider a domain beyond our reality. Somewhat like a mathematical construct. This is the group of all entities that may take any kind of configuration. Configuration here means any way how an entity may be connected to other entities. Entities of definition space therefore define constraints - constraints how different entities may be connected to each other. Configuration space is beyond our reach, because things defined there would first have to be <em>realized</em> in the sense of the word. The difference between a potential entity and a realized one is straightforward. Real entities are associated with pure energy.</p>\n<p><strong>Pure Energy</strong>: Is nothing else than energy, albeit devoid of any additional definitions. Hence, it is neither potential nor kinetic energy, no energy associated with mass or the energy involved in strong nuclear attraction. It is just Energy, the ingredient that changes a potential definition to be real and enacted, the essential requirement for something to be and something to happen (In Ii science the two aspects are essentially the same thing).</p>\n<p>Pure energy may flow between entities. Those are exactly the entities obtained from definition space. Energy flow means that the involved entities are real. Reality is defined by the flow of energy. Formerly potential constraints from definition space now become enacted. Potential constraints become real constraints. By enacting a specific constraint, pure energy becomes specific.</p>\n<p>Where does the energy come from? That place is as elusive as the Definition Space. The only factual knowledge about this domain is that its cardinality is higher than the cardinality of the definition space.</p>\n<p>Digging already into the structure of reality how the Ii see it, we can loose a word or two about those entities. Those can be coarsely separated into <strong>constraint</strong> and **instance **entities.</p>\n<ul>\n<li>Constraint: In _realized _scenarios we may refer to them as <strong>entities **and we may tend to name those in CAPITALS. They orchestrate the energy flow on to the next level of entities (those that are directly related to it). This orchestration may also be referred to as **interaction logic</strong> on a broader level, describing simply energy flow between realized objects.</li>\n<li>Instance: Those \"entities\" are usually simply referred to as objects. They are of mostly reactive character and will often simply relay energy back to the entity that transferred energy to it in the first place.</li>\n</ul>","fields":{"slug":"/2007/02/24/definition-space-pure-energy-and-entities"},"frontmatter":{"date":"February 24, 2007","path":null,"title":"Definition Space, Pure Energy and Entities","tags":["sci-fi"]}}},"pageContext":{"title":"Definition Space, Pure Energy and Entities","previous":{"fields":{"slug":"/2007/02/21/my-current-dream-energy-generation-for-a-quick-car","published":true},"frontmatter":{"title":"My current dream energy generation for a quick car","tags":["technology"],"date":"2007/02/21"}},"next":{"fields":{"slug":"/2007/03/02/geek-letter-pi","published":true},"frontmatter":{"title":"Geek Letter PI","tags":["software-development","loosely-coupled","dotnet","geekdom","mathematics"],"date":"2007/03/02"}}}}