{"data":{"markdownRemark":{"html":"<p>I was looking back at <a href=\"/go/113\">Christoph's ruby code</a> and was thinking that by now I should be able to implement that algorithm in Haskell. Indeed, one of my solutions looks like that:</p>\n<pre><code class=\"language-haskell\">out x\n    | x >= base = foldl (++) [] $ map (\\f -> out $ f x base) [mod,div]\n    | x &#x3C; base = digit\n    where\n        range = ['a'..'z']\n        digit = [range!!(fromIntegral x)]\n        base = fromIntegral $ length range\n</code></pre>\n<p>The digit to be output is a letter of the alphabet, so we are changing PI to a base 26 number system. Let's check it briefly: The <strong>map</strong> function maps one array to another. In this case the array consists of two functions, <strong>mod</strong> and <strong>div</strong>. mod returns the remainder of a division while div returns how often the divisor fits in the dividend.</p>\n<p>In other words, the right-hand side of the dollar-sign (which is a symbol in Haskell to influence the binding power of functions and often simply aids in removing the need to put an expression in brackets) returns an array like <code>[out(mod x base),out(div x base)]</code>. <strong>foldl</strong> then gobbles it all up coming from the left. It kicks off with an empty array ([]), takes the first element and concatenates it (++) to said array, then takes the second element in the array and (++) it to what it already has, and...you get it. Btw, !! is the indexer operation to an array [1,2]!!1 gives us 2.</p>\n<p>You may be wondering about two things:</p>\n<ol>\n<li>What is this <strong>fromIntegral</strong> stuff?</li>\n<li>Isn't the number that comes out backwards?</li>\n</ol>\n<p>To the first: fromIntegral's type is</p>\n<pre><code>Main> :t fromIntegral\nfromIntegral :: (Num b, Integral a) => a -> b\n</code></pre>\n<p>It's input is therefore an Integral. An integral, on the other hand, is an integer with \"infinite\" length. Yeah! I finally stumbled across a language that can do looong integers out-of-the-box.</p>\n<p>Hence, using fromIntegral in that context gives the following signature for the function:</p>\n<pre><code>Main> :t out\nout :: (Integral a) => a -> [Char]\n</code></pre>\n<p>It will get an arbitrary length integral and returns a String. Nice!\nAs to the second point...Let's marry the whole thing with some IO:</p>\n<pre><code>main = do\n  myPi &#x3C;- readFile \"c:/pi/pismaller.txt\"\n  writeFile \"c:/pi/tmp.txt\" (out $ read myPi)\n  piBackwards &#x3C;- readFile \"c:/pi/tmp.txt\"\n  writeFile \"c:/pi/output.txt\" (reverse piBackwards)\n</code></pre>\n<p>The <strong>out</strong> looks a bit lost there, but it does its job. You can see that at the end I turn around the string. Indeed, <strong>out</strong> spills out the rebased Pi backwards. Why? Well, the calculations for the last digits are finished first and so could in theory already be written out to the file. And you know what? That's just what Haskell does! Yeah, I know, you wouldn't really expect this, but on the other hand you think it could and it most probably will start to bind it all together.\nEven so, all this is not desperately efficient. The program took about 35 mins on my T43 (inside a VM) for the 1MB version of PI. Even so, the memory footprint was relatively small and stayed constant, but dividing that darned large number so many times just took a while.</p>\n<p>Well, <em><strong>I</strong></em> am impressed! Not something you need every day, but a task that had me finished in C#.</p>","frontmatter":{"date":"May 15, 2007","path":null,"title":"Haunted by PI - changing a number's base in Haskell","tags":["software-development","geekdom","mathematics","haskell"]}}},"pageContext":{"title":"Haunted by PI - changing a number's base in Haskell"}}