{"data":{"markdownRemark":{"html":"<p>Quite often feedback goes pretty wrong between interacting humans. What do I mean? Ever saw those shows about how to train your Dog? It is all about constructive feedback. Can you state when you gave constructive feedback to someone last time?</p>\n<p> </p>\n<p>In Patrick’s words, feedback is there to Improve effectiveness and to strengthen confidence. Anything else you may be doing to your peer may not be feedback. Feedback should be given earlier and it should be a safe thing, i.e., do it in private. Giving it earlier means that it just isn’t as much on one lump than your typical yearly feedback routine you may know from your corporation next door.</p>\n<p>Interesting is the focus on exhibited behaviour. Often we pre-judge people, but it is more productive to make statements about exhibited behaviour. The rule of thumb here is to state feedback based on a</p>\n<ul>\n<li>specific time</li>\n<li>the observed behaviour</li>\n<li>the perceived impact </li>\n</ul>\n<p>But what happens on the receiving end?</p>\n<p>It starts with the fact that you may not be getting any feedback. In this case only asking can help. When you get feedback, you could try to acknowledge the feedback and try not to defend yourself. Seek clarification on the impact of your behaviour! If you get good feedback, try not to forget to say thanks.</p>\n<p> </p>\n<p>This session isn’t specific to programming, but giving feedback has a great role in it. In a scenario of craftmanship, an apprentice learns through the feedback of a master. In a development team, the whole output can go to pots by the members not communicating properly. Look at any control diagram and you will find that a complex system cannot work without feedback. Giving feedback is about tuning a system. Tune yourself into goodness!</p>","frontmatter":{"date":"November 24, 2010","path":null,"title":"Øredev aftermath: Improve your Feedback with Patrick Kua","tags":["loosely-coupled","oredev"]}}},"pageContext":{"title":"Øredev aftermath: Improve your Feedback with Patrick Kua"}}