{"data":{"markdownRemark":{"html":"<p>MRCs form in the vicinity of pulsars. Pulsars have extremely strong magnetic fields rotating at considerable speeds. Given these pre-conditions and some other conditions that the surrounding material must fulfil (e.g. its distance from the pulsar, its distribution and its heat), Multi-resonance crystals are formed within a torus-shaped area surrounding the pulsar and its main particle jet. This describes an ideal situation as seen in the figure. Often the magnetic axis will not be perpendicular to the rotational axis, so that the particle streams arising from the rotating neutron star hits possible particles orbiting the Pulsar only at specific locations, turning the ideal resonance ring to resonance spots.</p>\n<p><img src=\"files/images/saitech1-fig4.gif\"></p>\n<p>The above picture simplifies the actual situation massively. The particle jet that reaches velocities well into a two digit percentage of the speed of light twists and bends while it is ferociously pulled along by the neutron star’s rotation. In a certain area that surrounds the star around its rotational axis, MRCs form due to the exotic and complex interactions bringing particles into strong entanglement to each other. In certain spots (and only for very limited amounts of time) it leads to the formation of matter that has a completely new state altogether. Those new-found properties are so astonishing that all possible classical measurements hardly describe the crystal’s surface and tell almost nothing about what is going on in the inside. Talking about this being crystalline hardly describes it since the properties of MRCs have little to do with the usual properties that we use to describe typed matter. Yet we will stick to the word for lack of a better term.</p>\n<p>As mentioned earlier, injuring the crystal’s structure from the outside leads to a change of material properties. This change can be very dynamic – in other words drastic or even catastrophic. While the elements that build up an MRC cannot be mapped onto the periodic table, such injury will cause a kind of transformation of the MRC’s matter into elements of classical 4Band physics. You can imagine the kind of effects when all sorts of elements of the periodic table and their negative counterparts plus loads of bosons reappear strained tightly into a crystalline structure whose inner parts are effectively rotating at several thousand revolutions per second.</p>\n<p>Seen from that perspective, witnesses of such accidents have been astonishingly lucky so far. Usually the creation of Random Fermions and Bosoms is so chaotic that much of the inner conflicts annihilate right there and then. But better close your ears and eyes tight if such an injured crystal is deeply coupled into an interaction matrix as used on Iilasian swarmships.</p>\n<p>As said before, the mathematical models and the available empiric evidence suggests that the innards of a MRC rotate at very high rates around its centre of gravity or the crystal’s axis passing through the smallest rotational moment of volume, depending on the crystal’s overall geometry.</p>","fields":{"slug":"/2007/03/15/where-to-find-mrcs"},"frontmatter":{"date":"March 15, 2007","path":null,"title":"Where to find MRCs","tags":["sci-fi"]}}},"pageContext":{"title":"Where to find MRCs","previous":{"fields":{"slug":"/2007/03/11/multi-resonance-crystals-mrcs"},"frontmatter":{"title":"Multi-resonance crystals (MRCs)","tags":["sci-fi"],"date":"2007/03/11"}},"next":{"fields":{"slug":"/2007/03/15/handling-mrcs"},"frontmatter":{"title":"Handling MRCs","tags":["sci-fi"],"date":"2007/03/15"}}}}