{"data":{"markdownRemark":{"html":"<p>Some effort goes into simulating a Quantum computer on a classical one, omitting the fact that such a simulation becomes arbitrarily slow due to the fact that a qubit encodes more information than a bit.</p>\n<p>As so often the entry point was an arxiv article from Peter Nyman, <a href=\"http://arxiv.org/abs/0705.3333\">Simulation of Quantum Algorithms with a Symbolic Programming Language</a>. All these articles constantly assume that you belong to the few select people who know exactly what all this is about (<em>sigh</em> there really is a _large _gap between popular science books and current research).</p>\n<p>Then I followed one of references to Thorsten Altenkirch's and Jonathan Grattage's <a href=\"http://www.cs.nott.ac.uk/~txa/publ/qml.pdf\">A functional quantum programming language</a>. Still not comprehensible for me. </p>\n<p>Here I followed another reference: Shin-Cheng Mu and Richard Bird, <a href=\"http://web.comlab.ox.ac.uk/oucl/work/richard.bird/online/MuBird2001Functional.pdf\">Functional quantum programming</a> from end of 2001. Lo and behold! _There _some basics are undertaken to simulate quantum computing in...Haskell!</p>\n<p>Sweet, I thought, maybe this is understandable for me. There is probably the chance for that, but it takes time. Still, numerous function definitions can be found which are very interesting in themselves for a beginning Haskell programmer.</p>\n<p>Just as an example from the first pages, the following Haskell code provides the basis to obtain a list of all possible segments of a list of values:</p>\n<pre><code class=\"language-haskell\">type Set a = [a]\nsingleton x = [x] \nunion = (++)\n\nprefixes :: [a] -> Set [a]\nprefixes [] = singleton []\nprefixes (a : x) = singleton [] `union` map (a :)(prefixes x)\n\nsuffixes :: [a] -> Set [a]\nsuffixes [] = singleton []\nsuffixes(a : x) = singleton (a : x) `union` suffixes x\n\nsegments :: [a] -> Set [a]\nsegments = concat . map suffixes . prefixes\n</code></pre>\n<p>O..M..G . I will probably die a stupid man.</p>","frontmatter":{"date":"May 24, 2007","path":null,"title":"Functional Programming and Quantum Computing","tags":["physics","haskell"]}}},"pageContext":{"title":"Functional Programming and Quantum Computing"}}