{"data":{"markdownRemark":{"html":"<p>Oh, yes! Finally, some visual information about the most sophisticated <strong>KAZOON class activity-centric ship</strong> of the swarm surrounding the SIX-FOLDED STAR OF YHLASUU. KAZOON simply meaning that the ship has a length of half a ship's length - If that does not make sense to you it is because you are not aware that a ship's length is a standardized measure in the World of the Ii.</p>\n<p>The whole story was kicked off during a couple of late night sessions with my partner-in-crime Andre Heimann. Pretty much at the beginning stood the concept of a very cool ship: Powerful and stylish, as we had the imagination that movement beyond the speed of light would also impose some kind of drag in the flight's direction. Since I was in the middle of my 4-month break between studies and first job, I sat down, took my copy of Rhino 3D and started drawing up the SAITRON.\n<div style=\"text-align:center;\">\n![SAITRON gen1: Generation 1 of the SAITRON](http://www.realfiction.net/assets/ship-gen1.gif \"SAITRON gen1: Generation 1 of the SAITRON\")</div>\n<p>This image is the only one presented from generation 1 of the ship. The basic flat shape is already present with the characteristic propulsion cross; That cross would hold the whirlspools, the propulsion units - The special shape would add to the maneuverability, allowing force vectors in all directions perpendicular to the cross surface.</p>\n<p>The front section shows a first idea of having the SAITRON act as a mother ship to relatively simple disc-shaped units. The cut-outs are rather coarse and with cut-outs more adapted to the daughter ship's shape, more of them could be carried by the mother unit. Alas, a different approach was followed.</p>\n<div style=\"text-align:center;\">\n![SAITRON gen2a](http://www.realfiction.net/assets/ship-gen2a.gif \"SAITRON gen2a\")</div>\n<p>The following three images show the intermediate generation 2. After having understood that the Ii had technology to create artificial gravitational fields it became clear that a changing gravitational vector over a relatively small distance allows\tfor the daughter ships to be placed perpendicular to the general orientation of the ship's levels. </p>\n<p>That way a total of 5 ships can hang on each side just like the teeth of a predator off the ship's front section.</p>\n<p><img src=\"http://www.realfiction.net/assets/ship-gen2b.gif\" alt=\"SAITRON gen2b\" title=\"SAITRON gen2b\"></p>\n<p>Another big advantage (Indeed a design consideration of the Chief construction Engineer Zainas Cziff) was the integration of the daughter ships'\twhirlspools into SAITRON's propulsion configuration when docked in, allowing for exceedingly good behaviour in terms of the ship's maneuverability.</p>\n<p>The central  (the red part on top of the ship) also shows its four levels, with copious amounts of space for the Ii who are lucky (and good) enough to work there.</p>\n<p><img src=\"http://www.realfiction.net/assets/ship-gen2c.gif\" alt=\"SAITRON gen2c\" title=\"SAITRON gen2c\">\n<span class=\"clearfix\">.</span></p>\n<div style=\"text-align:center;\">\n![SAITRON gen3b](http://www.realfiction.net/assets/ship-gen3b.gif \"SAITRON gen3b\")\n</div>\n<p>The last generation brought in the last details that were made on this Rhino-model, beginning with the hangars for the daughter ships and some additional \"cooling\" for the main remote resonance cannon.</p>\n<p>Unfortunately I never came around to add the detail to the propulsion section, to be imagined with maybe a grand total of 60 whirlspools.</p>\n<div style=\"text-align:center;\">\n![Gen3c](http://www.realfiction.net/public/assets/ship-gen3c.gif \"Gen3c\")\n</div>\n![SAITRON ship 3d](http://www.realfiction.net/public/assets/ship-gen3d.gif \"SAITRON ship 3d\")\n<p>This was the end of it. Most of the principle weaponry of the ship can now be seen - 8 remote resonance cannons on each side, also the very flexible tower cannons on the aft of the ship. The bottom two cannot be seen. </p>\n<p>Completely missing is all weaponry that is part of the ship's front section. The big connector locks (A big one on each side, two smaller ones on top and bottom respectively) required to connect into swarm compounds also aquired some detail.</p>\n<p><span class=\"clearfix\">.</span></p>\n<div style=\"text-align:center;\">\n![SAITRON gen3a](http://www.realfiction.net/public/assets/ship-gen3a.gif \"SAITRON gen3a\")</div>","frontmatter":{"date":"June 07, 2006","path":null,"title":"SAITRON in visuals","tags":["sci-fi"]}}},"pageContext":{"title":"SAITRON in visuals"}}