{"data":{"markdownRemark":{"html":"<p>This essay has attempted to give you an extremely brief run-through of the key to Iilasian technology. The technology presented here allows the Ii to have ready access to vast amounts of matter of all type from a source that does not bring penalties in terms of excessive electromagnetic charge or gravitational mass or other types that can be encountered in the 4Band continuum. It has been described where Multi-resonance crystals (MRCs) can be found, how they can be harvested and how they become the core of a rotating interaction matrix (RIM), a system which overcomes numerous drawbacks with which pure MRCs come along.</p>\n<p>Some but by far not all of the difficulties of controlling this technology have been presented. We have for example not even begun to discuss the difficulties in containing a charged RIM - with increasing charge things like pressure and radiation do become a great issue and there are technical limitations arising from the components of the containing electromagnetic field. Also, with the containing interactions being still quite close to standard 4Band interactions, how can more exotic particle streams be obtained from the RIM?</p>\n<p>Nonetheless, without access to such an energy, other core technologies of the Ii like generating shielding fields, the workings of the remote resonance cannons or indeed interstellar flight at speeds beyond light speed would not be achievable. RIM creation, containment and utilization is a precursor to the advanced technological systems that guarantee the functioning of the Iilasian swarm.</p>","fields":{"slug":"/2007/03/18/conclusion"},"frontmatter":{"date":"March 18, 2007","path":null,"title":"Conclusion","tags":["sci-fi"]}}},"pageContext":{"title":"Conclusion","previous":{"fields":{"slug":"/2007/03/18/untyped-matter-amp;-rim-fuelling","published":true},"frontmatter":{"title":"Untyped matter &amp; RIM fuelling","tags":["sci-fi"],"date":"2007/03/18"}},"next":{"fields":{"slug":"/2007/04/01/c-3-0-hair-extensions-for-wanna-be-rubyists","published":true},"frontmatter":{"title":"C# 3.0 - Hair extensions for wanna-be rubyists","tags":["software-development","ruby","dotnet"],"date":"2007/04/01"}}}}