{"data":{"markdownRemark":{"html":"<p>Once in a while I need a break from my day-to-day job in C# land. Don't get me wrong, I like the language, but it doesn't cover <em>all</em> of my intellectual needs.\nMore specifically, if I</p>\n<ul>\n<li>Need some functional, imperfect chaos, which gets much done nonetheless, or in <a href=\"http://www.hanselman.com/blog/JavaScriptIsAssemblyLanguageForTheWebSematicMarkupIsDeadCleanVsMachinecodedHTML.aspx\">Scott Hanselman's words</a>, if I want to do some assembly language, I go and visit <strong>JavaScript</strong></li>\n<li>Need purity, the most amazing compiler that ruthlessly cracks down on any typing (in the computing sense) error you do, the serenity of a perfect universe that simulates dirt only if it has to, then I visit <strong>Haskell</strong>.</li>\n</ul>\n<p>This time it was Haskell's turn - the <a href=\"http://realfiction.net/go/92\">last time</a> I delved into Haskell, I hadn't really touched its type system, only used those already in place. This time I wanted to rectify that.</p>\n<h3>Behold - the Roman number</h3>\n<p><a href=\"https://gist.github.com/flq/6273665#file-roman-hs\">The gist</a></p>\n<p><strong>Disclaimer:</strong> <em>I may have only implemented a subset of the proper rules of how to write Roman numbers. If you use this type to calculate the altitude of your plane, and it doesn't work, don't sue me, because I give no guarantees as to the 100% correctness of the code</em></p>\n<p>The Roman number <em>cough</em> system <em>cough</em> had no extraordinary mathematical capabilities - I am not aware of any systematic approach that would let you add two Roman numbers. Their only purpose must have been to attach a word to a number.</p>\n<p>The interesting parts with regard to the type system are <strong>lines 8-22</strong>. What is defined here is</p>\n<ul>\n<li>What a <em>Roman</em> is : It has two constructors that take a String or an Int</li>\n<li>That a <em>Roman</em> can be shown, which makes it interesting e.g. in the interactive mode of Haskell</li>\n<li>That two <em>Romans</em> can be compared</li>\n<li>That a <em>Roman</em> behaves like a <em>Num</em> type</li>\n</ul>\n<p>The rest is really just a fair enough implementation of how to get from something like <strong>MCMLXXXIV</strong> to <strong>1984</strong>.</p>\n<p>The (probably quite inaccurate) conclusions I take away from this quick splash into Haskell-land</p>\n<ul>\n<li>Haskell classes can be compared somewhat to interfaces, but they can carry default implementations</li>\n<li>Haskell data can have what could be compared to multiple constructors, but later on we can actually match on how data was constructed</li>\n<li>Not used here, but Haskell has a decent record syntax (yes, I am pointing at you, <a href=\"http://learnyousomeerlang.com/a-short-visit-to-common-data-structures\">Erlang</a>) </li>\n<li>The capabilities, or traits, or contracts or whatever you like to call them are much cleaner defined. Not every <em>thing</em> is by default equatable. Not every <em>thing</em> is by default displayable.</li>\n</ul>\n<p>All in all, once again, refreshing, and purifying ;)</p>","frontmatter":{"date":"July 26, 2013","path":null,"title":"Exploring Haskell's type system - A Roman number type","tags":["software-development","haskell"]}}},"pageContext":{"title":"Exploring Haskell's type system - A Roman number type","previous":{"fields":{"slug":"/2013/05/27/a-knee-shot-involving-structuremap-a-closure-and-a-leaking-implementation-detail"},"frontmatter":{"title":"A knee-shot involving StructureMap, a closure and a leaking implementation detail","tags":["software-development"],"date":"2013/05/27"}},"next":{"fields":{"slug":"/2013/07/31/atrocious-learnings-of-haskell-for-make-benefit-of-solving-math-problem"},"frontmatter":{"title":"Atrocious Learnings of Haskell for Make Benefit of solving Math Problem","tags":["software-development","haskell"],"date":"2013/07/30"}}}}