{"data":{"markdownRemark":{"html":"<p>Well, that's done. It took a moment or two to update the site from drupal 4.7 to 5.1. The administration looks good, it has been cleaned up for the better, and the update process was fairly straightforward. </p>\n<p>Basically all modules I was using have already been ported to the 5x platform - apart from the code formatting module. I had to fall back to a simpler one available, which may be just sufficient for the few lines of code I provide here &#x26; there.</p>\n<p>I ran into a small problem regarding the functionality of attaching files to given content. The functionality was provided by the **disknode **module, but now there is actually a drupal core module doing pretty much what I need, the **upload **module. Both modules basically work with the same drupal table, <em>files</em>. But my old attachments were not visible anymore. Only when adding a line in the_ file<em>revisions</em> table, associating the file with its actual visibility, was I able to let my old entries reappear. Ace!</p>\n<p>Well, the site looks a tad different. The theme is bluntly based on the Zen-theme available from Drupal, but theme development requires some time, which I wasn't able to invest this weekend, so this'll have to do for now (and darn it looks <em>simple</em>, so I like it!)</p>\n<p>The actual upgrade procedure was extremely pain free, thanks once more to the superb virtual machine, <a href=\"http://canned-os.blogspot.com/2006/10/grandmas-lamp-its-easy-enough-for.html\" title=\"LAMP so easy, even your grandma can do it!\">Granma's Lamp</a>. This xubuntu-based machine comes with PHP, MySQL, all running on apache. Installing my site on the machine was quickly done, and from there I could do all the upgrading. Once I was done, I went on exporting my DB, zipping up the drupal folder, and drop it in my webspace. In 5 minutes everything was set up and running again. Did I mention I love this virtual machine stuff? Did I mention I quite like drupal?...</p>","frontmatter":{"date":"February 19, 2007","path":null,"title":"Update to Drupal 5.1 - Check!","tags":["meta","tools"]}}},"pageContext":{"title":"Update to Drupal 5.1 - Check!","previous":{"fields":{"slug":"/2007/01/26/some-hints-on-how-different-java-generics-appear-to-be-to-net-generics"},"frontmatter":{"title":"Some hints on how different JAVA generics appear to be to .NET generics","tags":["software-development","dotnet","JAVA"],"date":"2007/01/26"}},"next":{"fields":{"slug":"/2007/02/20/google-and-a-i"},"frontmatter":{"title":"Google and A.I.","tags":["technology","biology"],"date":"2007/02/20"}}}}