{"data":{"markdownRemark":{"html":"<p>About 5 years ago I started work on a library that helps in dealing with measurements because a client\nwas falling for <a href=\"/2010/11/30/dealing-with-primitive-obsession-this-time-measurements\">primitive obsession</a>. Follow the link to read what it's all about. Some details\nare not 100% correct anymore but in general it still serves well.</p>\n<p>After figuring out with MemBus that producing nuget packages has become an incidental activity, I wanted\nto revive that dormant library, give it some love and dogfooding it a bit to myself.</p>\n<p>The result is <a href=\"https://www.nuget.org/packages/NMeasure/\">NMeasure</a>, which has been used for the following example calculation.</p>\n<p>You may have heard about the global warming summit and that scientists have basically agreed with each other\nthat we should try really hard to avoid the atmosphere to heat up an additional 2 degrees on average. It doesn't sound much,\nbut I was curious what this number means in terms of additional energy that the atmosphere would contain.</p>\n<p>Before we carry on...</p>\n<h4>Disclaimer:</h4>\n<ul>\n<li>The produced number is pretty much a ballpark figure, because</li>\n<li>We assume Earth to be a flat sphere (not too bad)</li>\n<li>\n<p>We only consider the volume from 0-2km above sea level</p>\n<ul>\n<li>at constant density (that will introduce an error in the 2-digit percentage range)</li>\n</ul>\n</li>\n<li>We deal purely with averages (coming from a uniform temperature to a new uniform temperature)</li>\n<li>The calculated energy is not freely available as such, it is just to give you a feel for what is at stake.</li>\n</ul>\n<h3>On we go</h3>\n<p>The calculation has been kept pretty straightforward:</p>\n<ul>\n<li>We take the volume of the low atmosphere</li>\n<li>We look up the <a href=\"https://www.google.de/search?q=specific+heat+air\">specific heat of air</a> in the proper temperature range (assuming today's average temperature of 14°C) with constant volume. </li>\n<li>We multiply it all through and get a number.</li>\n</ul>\n<p>The calculation is shown in the following gist with the aid of NMeasure:</p>\n<p>{% gist flq/aaf315d162e7394865b4 Program.cs %}</p>\n<p>NMeasure profits <em>a lot</em> from C# 6's ability to use static members of a type (see line 4). The units used\nare static properties of the type <em>U</em> (e.g. U.KiloMeter) and it is really tasty to be able to use the units as shown in the\nprogram.</p>\n<p>Line 13 ensures that a lot of conversions dealing with SI and Imperial units are known to NMeasure. Yes, Units and conversions\nare not hard-coded, you need to set them up before you start using NMeasure. That way, you are free to introduce your own\nmeasurement units<sup>*)</sup>.</p>\n<p>With regard to the available operators: Only when I found some odd behaviour around operator precedence did it occur to me\nthat the <em>^</em>-operator is a bitwise operator in C# and has usually nothing to do with the mathematical operation\n<em>x to the power of y</em> - I've left it in, though, since it is used like that in numerous other languages. The disadvantage\nis that in C# the operator has even lower precedence than addition/subtraction, which makes some silly brackets necessary.</p>\n<p>Once the calculation is performed we arrive at this number:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">1.795E+12 GJ</code></pre></div>\n<p>of additional energy available in the atmosphere.\nSounds quite a lot, and it is. If we compare this to the <a href=\"https://en.wikipedia.org/wiki/List_of_countries_by_electricity_production\">World's energy production</a> we see that in order to make\nthis amount of energy available, our current energy production would have to run for about <em>21 years</em>.</p>\n<p>Of course this energy isn't freely available in full, but it adds a lot more dynamics to any transient phenomena occurring\nin the atmosphere, i.e.</p>\n<ul>\n<li>changes are quicker</li>\n<li>frequencies get higher</li>\n<li>amplitudes grow</li>\n</ul>\n<p>Here we are, one incoherent blog post further, probably none the wiser - but at least I could scratch two itches at once!</p>\n<h3>*)</h3>\n<p>A long time ago I was crazy enough to construct a unit system for a species appearing in some of my Sci-Fi stuff. I extracted\nit from an old Excel-sheet of mine into a test harness:</p>\n<p>{% gist flq/aaf315d162e7394865b4 IiUnitTests.cs %}</p>","fields":{"slug":"/2015/12/30/nmeasure-and-the-global-warming"},"frontmatter":{"date":"December 30, 2015","path":null,"title":"NMeasure and the global warming","tags":["physics","own-software","dotnet","site"]}}},"pageContext":{"title":"NMeasure and the global warming","previous":{"fields":{"slug":"/2015/08/28/porting-a-react-application-to-typescript"},"frontmatter":{"title":"Porting a react application to typescript","tags":["web","programming","typescript","javascript","react"],"date":"2015/08/27"}},"next":{"fields":{"slug":"/2016/02/04/where-is-the-house"},"frontmatter":{"title":"Where is the house","tags":["fsharp"],"date":"2016/02/04"}}}}