{"data":{"markdownRemark":{"html":"<p>You know you love a programming language when it still manages to surprise you with something you didn't know about. </p>\n<p>One of the comments on <a href=\"http://blogs.msdn.com/ericlippert/\">Eric Lippert's blog</a> used a funny looking method signature I hadn't seen before...suppose you start a little Console application and write something like that:</p>\n<pre><code class=\"language-csharp\">class Program {\n  static void Main(string[] args) {\n    Person p = new Person(23);\n    // Of course: \n    // \"Cannot implicitly convert type 'TestImplicit.Person' to 'TestImplicit.Animal'\"\n    Animal a = p; \n    Console.WriteLine(a.Age);\n    Console.ReadLine();\n  }\n}\n\nclass Person {\n  public readonly int Age;\n  public Person(int age) {\n    Age = age; \n  }\n}\n\nclass Animal {\n  public readonly int Age;\n  public Animal(int age) {\n    Age = age;\n  }\n}\n</code></pre>\n<p>Fine...what happens, if you extend the Animal class in the following fashion, though?</p>\n<pre><code class=\"language-csharp\">class Animal {\n  public static implicit operator Animal(Person p) {\n    return new Animal(p.Age);\n  }\n  public readonly int Age;\n  public Animal(int age) {\n    Age = age;\n  }\n}\n</code></pre>\n<p>The effect is that the line...</p>\n<pre><code>Animal a = p;\n</code></pre>\n<p>now compiles without any trouble. </p>\n<p>Well, that's something I didn't know! I would think that there are actually some valid reasons why this operator is fairly unknown: As the operator name already hints, it adds implicit behaviour. Implicitness, however, can really trouble the mind of a developer, which can be good, but certainly not always.</p>\n<p>In other words, there are explicit ways to do such a conversion. Provide a method that does the step, etc. One scenario where such a conversion could be interesting is when switching from a base class to a specialized class. You get a nice place in your code where you could provide a specialized instance with information that goes beyond the one of the base class. In order to write this code, though, the base class would have to know about specialized classes that inherit from said class...hm. Fair enough, applying appropriate patterns would alleviate the issue.</p>\n<p>At the end of the day, programming has quite a bit to do with creativity. There may be scenarios out there where the implicit operator would be just the right thing to use, but for now, I don't know any. Me, I just like the fact to learn about another obscure facet of C#...</p>","frontmatter":{"date":"November 10, 2007","path":null,"title":"C# implicit operator","tags":["software-development","dotnet"]}}},"pageContext":{"title":"C# implicit operator"}}