{"data":{"markdownRemark":{"html":"<div class=\"messages status\">\nThe incredible truth is that there are constantly synchronicities. While I was quickly jotting down the contenders for the Dependency Injection throne in .NET, others make full-blown, multi-part comparisons. Need an example? Go here:\n<ul>\n<li><a href=\"http://blog.ashmind.com/index.php/2008/08/19/comparing-net-di-ioc-frameworks-part-1/\">Comparing .NET DI (IoC) Frameworks, Part 1</a></li>\n<li>\n<p><a href=\"http://blog.ashmind.com/index.php/2008/09/08/comparing-net-di-ioc-frameworks-part-2/\">Comparing .NET DI (IoC) Frameworks, Part 2</a></p>\n</div>\n</li>\n</ul>\n<p>There are a number of reasons why <a href=\"http://www.martinfowler.com/articles/injection.html\">Dependency Injection</a> is a good thing, and many people of high esteem have written about it. Hopefully only those developers completely cut off from modern-day communications are left with a good excuse not to know about this subject.</p>\n<p>Do I sound too dogmatic? Well, to be honest, if you are undertaking a project of a certain degree of complexity that is meant to be maintainable I find the use of a DI framework easier to justify than not using it. It really helps to get to grips with a clean OO-approach. It helps your code to stay <a href=\"http://www.lostechies.com/blogs/chad_myers/archive/2008/03/07/pablo-s-topic-of-the-month-march-solid-principles.aspx\">SOLID</a>.</p>\n<p>As a .NET developer you are indeed spoiled with choice - it's almost like back in Java, if you know what I mean. Which DI Container should you take?</p>\n<p>This post could be interpreted as a starting point to get links and a few warm words to the choice available. Without further ado, let's get going...</p>\n<h1><a href=\"http://www.castleproject.org/container/index.html\">Castle Windsor</a></h1>\n<p>Castle Windsor is the first DI container I have used in .NET. It is quite present in the community since it has links to some other very popular frameworks, <a href=\"http://www.castleproject.org/activerecord/index.html\">ActiveRecord</a> (a design pattern in itself which you will have to consciously choose but which will make your life with NHibernate a lot easier once you do) and <a href=\"http://www.castleproject.org/monorail/index.html\">MonoRail</a>, which was giving you rails long before Microsoft figured out what <a href=\"http://en.wikipedia.org/wiki/Model_View_Controller\">MVC</a> <a href=\"http://www.asp.net/mvc/\">could mean</a> for the web generation.</p>\n<p>Castle Windsor's official download is of a \"Version 1 Release Candidate 3\". This does not tell much of the quality, because the features you get are well tested and can be used without problems in a production environment. I have once made a comparison performance wise of Spring.NET and Castle Windsor <a href=\"http://realfiction.net/go/143\">here</a>, which will show you a basic configuration scenario.</p>\n<p>We used said version and the best way to configure it was via (an) XML file(s). All major concerns you expect to be solved by DI are solved, however the configuration via XML can get nasty, especially when you use generic classes and interfaces (IDictionary`2[[System.String, mscorlib],[System.String, mscorlib]] anyone?).</p>\n<p>Castle Windsor is probably the largest of all DI containers I know as it has legions of additional functionality. The only sensible way to get to them is to pull down their current trunk. In my opinion it makes the project less accessible than others. Either way, if you want your container to also handle e.g. WCF integration and also get your hands on a fluent interface to handle the configuration side of things, it is worth having a look into this project (Also see <a href=\"http://realfiction.net/go/160\">why I couldn't get my INotifyPropertyChanged proxy to work</a> with the 1.0RC3 version of DynamicProxy2). One of the system's selling point is also the possibility to change the configuration during system runtime, something not allowed by every DI container.</p>\n<p>Lastly, one of the contributors, Hamilton Verissimo, aka hammett, will be <a href=\"http://hammett.castleproject.org/?p=312\">joining Microsoft</a>. Although he states that nothing changes for Castle, I am wondering whether his efforts won't be needed to give Unity a stronger voice in the community.</p>\n<h1><a href=\"http://www.springframework.net/\">Spring.NET</a></h1>\n<p>There is not much I can tell about this one, apart from the fact that I know the name from old Java times and that it looks like Java devs would probably go for Spring.NET since they would feel right at home. It was presented at our company and from what I can see it should provide you with typical DI functionality, but I commonly hear that the configuration side of things is rather heavy (where's my \"say NO to XML\" shirt?).</p>\n<h1><a href=\"http://ninject.org/\">Ninject</a></h1>\n<p>This is a recent addition to the landscape, a system developed by <a href=\"http://kohari.org/\">Nate Kohari</a>. This is one container that leaves behind XML files for a fluent API to be talked to with your MSIL beautifier of choice. Additionally, the introduction of something Nate calls <strong>contextual binding</strong> makes for some interesting functionality:\n<code class=\"language-text\">// Adding some spice to the &quot;Bind&quot; call Ninject provides in its &quot;Modules&quot;\nprotected ViewModelSetup&lt;M&gt; RegisterModel&lt;M&gt;(string modelID) where M : IViewModel\n{\n  Bind&lt;IViewModel&gt;().To&lt;M&gt;().Only(When.Context.Variable(BaseWindow.ModelID).EqualTo(modelID));\n  return new ViewModelSetup&lt;M&gt;(this, modelID);\n}\n// ...somewhere else...\npublic ViewModelSetup&lt;M&gt; WithControls(ControlMap controlMap)\n{\n  module.Bind&lt;ControlMap&gt;().ToConstant(controlMap).ForMembersOf&lt;M&gt;();\n  return this;\n}</code></p>\n<p>This is just one example of a number of possibilities. The idea is to provide dependencies based on the context of your request, be it that you add your own stuff to a present context object or that it allows you to state things like \"Dependency d should be satisfied with object x provided that the target parameter y is decorated with attribute A.\".</p>\n<p>The configuration interface is lovely, you probably won't miss the fact that there is no XML configuration available. The framework is quite usable and has a good performance for what it does (but also not orders of magnitude away from other DI servicing candidates).</p>\n<p>For me the most problematic current omission (Ninject is in Version 1) is that I cannot define <em>n</em> classes all satisfying service <em>s</em> and get all those dependencies at once e.g. in the form of an array like <em>s[]</em>.</p>\n<p>Documentation is there for the most basic scenarios but if you get stuck it's best to post something on Ninject's <a href=\"http://groups.google.com/group/ninject\">usergroup</a>.</p>\n<h1><a href=\"http://structuremap.sourceforge.net/Default.htm\">StructureMap</a></h1>\n<p>This container seems to have been around for quite some time, and there are a number of mainainers, most notably the creator <a href=\"http://codebetter.com/blogs/jeremy.miller/\">Jeremy Miller</a>, and just mentioning <a href=\"http://www.lostechies.com/blogs/chad_myers/\">Chad Myers</a>, since he has been helping out with some nice <a href=\"http://www.lostechies.com/blogs/chad_myers/archive/tags/StructureMap/default.aspx\">explanatory blog posts</a> on Structuremap (code <a href=\"http://sourceforge.net/projects/structuremap/\">here</a>).</p>\n<p>During the past half a year I tried once or twice to break into its mindset. The third time round just a few days ago I finally made some progress into it, so far that it feels like it could be the right choice for one of my upcoming projects. Let me try and explain why.</p>\n<ul>\n<li>While this thing does have some XML config layer, much effort is going into a fluent interface for configuration.*   Support of arrays of stuff is strong (pipelines are not only a Russian thing).</li>\n<li>Attributes PluginFamily and Plugin allow for easy implementations of ...plugins (doh!).</li>\n<li>Defining autowiring capabilities based on your own implementation of a TypeScanner, thereby allowing you to state conventions on how to bind together stuff, is just plain neat. Why shouldn't a FunkDataSet be automatically bound to a FunkModel, if it is depending on one? (Yeah, go flak me for using the D-word!)</li>\n<li>\n<p>Jeremy and colleagues seem to be working away towards version 2.5 of StructureMap which seems to fully embrace 3.5 framework capabilities. I haven't looked much at the code yet, but some parts make heavy use of Expressions which should allow you to write some really expressive ;) code.</p>\n<p>StructureMap also has a user group over [here](http://groups.google.com/group/structuremap-users).\n</li>\n</ul>\n<h1><a href=\"http://code.google.com/p/autofac/\">AutoFac</a></h1>\n<p>This is really just a pointer. I can't say anything about it since I haven't tried it yet. If anything changes about that I will gladly post here.</p>\n<h1><a href=\"http://www.codeplex.com/unity\">Unity</a></h1>\n<p>Same goes to Unity. No hands-on experience yet. I should certainly note that this is Microsoft's offering in this matter, with Unity being part of the grand scheme of Enterprise Application blocks.</p>\n<hr>\n<p>I hope you enjoyed this post and feel free to comment about your own experiences with any of the listed frameworks or if I did completely miss some offering.</p>\n<p><a href=\"http://www.dotnetkicks.com/kick/?url=http%3a%2f%2frealfiction.net%2f%3fq%3dnode%2f166\"><img src=\"http://www.dotnetkicks.com/Services/Images/KickItImageGenerator.ashx?url=http%3a%2f%2frealfiction.net%2f%3fq%3dnode%2f166&#x26;bgcolor=0000CC\" alt=\"kick it on DotNetKicks.com\"></a></p>","frontmatter":{"date":"September 07, 2008","path":null,"title":"Spoiled with Dependency Injection","tags":["dotnet","patterns"]}}},"pageContext":{"title":"Spoiled with Dependency Injection","previous":{"fields":{"slug":"/2008/08/18/some-nice-scale-videos"},"frontmatter":{"title":"Some nice scale videos","tags":["physics","loosely-coupled"],"date":"2008/08/18"}},"next":{"fields":{"slug":"/2008/09/23/nhibernates-isession-scoped-for-a-single-wcf-call"},"frontmatter":{"title":"NHibernate's ISession, scoped for a single WCF-call","tags":["libs-and-frameworks","dotnet"],"date":"2008/09/23"}}}}