{"data":{"markdownRemark":{"html":"<p>If your answer is yes, please read on, because, <em>once</em>, I thought so, too.</p>\n<p>Let me first clarify what I mean by leaks in a .NET application. Under this definition you may have a leak when an instance persists in memory even though you expect it to be collected by the Garbage collector. A typical usage of your App on your local desktop may not expose any issues since local memory can be quite sufficient and some problems may only occur because of certain usage patterns. In other environments like e.g., a <a href=\"http://www.citrix.com/lang/English/home.asp\">Citrix Desktop</a>, where the app runs in a much more constrained environment, problems may become apparent far quicker. </p>\n<p>In a windows forms application memory pressure is even higher, because Windows Forms, as it turns out, is a thin layer of .NET on top of a multi-decade old technology, <a href=\"http://en.wikipedia.org/wiki/Graphics_Device_Interface\">GDI</a>. The great <a href=\"http://technet.microsoft.com/en-us/sysinternals/bb896653.aspx\">Process Explorer</a> allows you to look at the GDI Objects consumed by any process by turning on the respective column:</p>\n<p> <img src=\"/assets/gdiObjects_6ffad6a0-8d1a-496a-93b8-ddf5f53cc21a.png\" alt=\"gdiObjects\" title=\"gdiObjects\"> </p>\n<p>The resource of GDI objects is quite limited, as it may not surpass a number defined in the registry as <strong>GDIProcessHandleQuota</strong>. The default is 10’000. You may increase that number, but as you can see you may run out of GDI Object handles long before your memory is exhausted.</p>\n<p><img src=\"/assets/handleQuota_5cab2b59-cbb5-4178-8868-0c5082df4bd0.png\" alt=\"handleQuota\" title=\"handleQuota\"> </p>\n<p>How can this be? .NET has a Garbage Collector (GC), or has it? Indeed, none of the issues arise because the GC is broken. It is not. The biggest source of loosing objects is by <strong>attaching event handlers to events of objects that live longer than the instances to which the event handlers belong</strong>. Add to this the failure to <strong>correctly Dispose of Objects in the System.Windows.Forms namespace</strong>. Let’s check out some real life examples.</p>\n<p>The single most useful tool to approach possible issues with memory is a memory profiler. There are several on the market but since I am a sucker for Jetbrains products my choice fell on the <a href=\"http://www.jetbrains.com/profiler/features/index.html\">dotTrace</a> product.</p>\n<h3>1. Bad Icon, bad</h3>\n<p>The most hefty GDI object leak was related to…icons. The following code is <em>reeally baad</em>:</p>\n <div style=\"padding-bottom: 0px; margin: 0px; padding-left: 0px; padding-right: 0px; display: inline; float: none; padding-top: 0px\" id=\"scid:812469c5-0cb0-4c63-8c15-c81123a09de7:c99699f5-203e-48c1-908c-6d82e68ce008\" class=\"wlWriterEditableSmartContent\"><pre name=\"code\" class=\"c#\">changeProvider.Icon = \n  Icon.FromHandle(Resources.data_edit.GetHicon());</pre></div>\n<p>I really don’t know enough about this sort of resource creation but after some strange behaviour regarding errors, the code was modified to the following (as outlined in the <a href=\"http://msdn.microsoft.com/en-us/library/system.drawing.bitmap.gethicon.aspx\">documentation to GetHicon()</a>):</p>\n<div style=\"padding-bottom: 0px; margin: 0px; padding-left: 0px; padding-right: 0px; display: inline; float: none; padding-top: 0px\" id=\"scid:812469c5-0cb0-4c63-8c15-c81123a09de7:0c5123fc-0219-494f-b88a-02105d69d70b\" class=\"wlWriterEditableSmartContent\"><pre name=\"code\" class=\"c#\">[System.Runtime.InteropServices.DllImport(\"user32\")]\npublic static extern bool DestroyIcon(IntPtr hIcon);\n...\npublic static Icon RetrieveEditIcon()\n{\n  var hIcon = Resources.data_edit.GetHicon();\n  var temp = Icon.FromHandle(hIcon);\n  var ico = (Icon)temp.Clone();\n  temp.Dispose();\n  DestroyIcon(hIcon);\n  return ico;\n}</pre></div>\n<h3>2. The GC-Alloc’d Timer</h3>\n<p>You may or may not have the same opinion about Windows.Forms Binding but in my eyes it is an absolute beast. We are using a concept of Control connectors that abstract the behaviour of controls for our system. In there a timer is used that gets its say after a short period of the user typing in stuff in a textbox. That way we get a binding that is more logical to the user than the Focus Lost behaviour and is less intrusive than the SourceChanged Binding. To my dismay, something weird was happening to the TimerCallback, the Event handler delegate that represents a callback from the timer:</p>\n<p><img src=\"/assets/timerLeak_6e94ad39-e5bd-4722-8a31-7ec4b782389c.png\" alt=\"timerLeak\" title=\"timerLeak\"> </p>\n<p>A Garbage Collector Handle was keeping my Timer callback to go away. Since it was connected to a connector which in turn exposes events to other parts of some application module, all kind of objects are now stuck in memory, objects that due to their affinity to Windows Forms may also leak GDI objects.</p>\n<p>Such handles can be constructed with the <a href=\"http://msdn.microsoft.com/en-us/library/system.runtime.interopservices.gchandle_members(v=VS.100).aspx\">GCHandle</a> struct. they allow you to pin objects to memory, avoiding that they be reclaimed by the Garbage Collector. I haven’t quite understood the behaviour to date, as the documentation of the <a href=\"http://msdn.microsoft.com/en-us/library/system.threading.timer.aspx\">Timer</a> says nothing about such behaviour. On the contrary, it puts the responsibility to the Timer’s user to ensure that a timer does not go out of scope.</p>\n<p>The basic solution is to ensure explicit disposal of a timer, in our case by listening to the connected control’s Disposed-event. Alas, in some circumstances it appears that the Control’s Dispose was not called, leaving us still with objects dangling off the timer. The final end to this problem was to make the connection between Timer and event handler <em>weaker</em>.</p>\n<div style=\"padding-bottom: 0px; margin: 0px; padding-left: 0px; padding-right: 0px; display: inline; float: none; padding-top: 0px\" id=\"scid:812469c5-0cb0-4c63-8c15-c81123a09de7:1847e869-180d-472a-af31-81db5edffbe2\" class=\"wlWriterEditableSmartContent\"><pre name=\"code\" class=\"c#\">private readonly Timer changeDelayTimer;\n...\nchangeDelayTimer = new Timer(onChangeDelayCallback, new WeakReference(this), ...);\n...\nprivate static void onChangeDelayCallback(object state)\n{\n  var wr = (WeakReference) state;\n  if (wr.IsAlive)\n   ((TextBoxConnector)wr.Target).HandleTimerSignal();\n}</pre></div>\n<p>The timer now references a static handler, and just to be sure, the actual object is only accessible through a WeakReference object. Such a thing allows a targetted object to be collected by the GC. There may still be a minor headache in case that the GC collects the object between the if-statement and the access in the next line, but at least we got rid of the object trees dangling off the timer.</p>\n<h3>3. The 3rd party static event</h3>\n<p>Imagine you use some component and suddenly you realize that said component attaches to a static event handler, i.e. a part of the system that remains alive until the end of the AppDomain. This is what happens to you when you do not explicitly dispose certain components from <a href=\"http://www.infragistics.com/\">Infragistics</a>:</p>\n<p><img src=\"/assets/gridLeak_534c2e57-c6a5-447c-8714-6245a2af9029.png\" alt=\"gridLeak\" title=\"gridLeak\"></p>\n<p>Infragistics was already made aware of this kind of behaviour quite some time ago as shown in this <a href=\"http://forums.infragistics.com/forums/t/20841.aspx\">discussion thread</a>. As they say that this behaviour is by design and just make sure that all Controls get properly disposed, things remained like that up to the version that we are utilizing for the project. The solution to that one is either dispose of all controls, or use the somewhat dirty but effective move to empty the invocation list of the relevant static events. This is indeed possible through reflection and funny enough the required code had already been written and <a href=\"http://subjectively.blogspot.com/2009/03/importance-of-recycling-memory.html\">is available on the Internet</a>. Since we don’t use any of the theme changing capabilities of Ig controls, this code is called at an appropriate moment and it ensures that no component leak happens through that chain anymore.</p>\n<h3>4. Undisposed Tooltips</h3>\n<p>Funny enough in the first snapshots I didn’t find much trace of undisposed tooltips but this was the case now in the latest snapshots that I was doing with dotTrace. One would think that issues as can be found with the <a href=\"http://www.google.de/search?ie=UTF-8&#x26;q=windows+forms+tooltip+gdi+object+leak\">proper google search</a> are not relevant anymore, but there you go…Tooltips really aren’t that heavy objects, but their missing removal was a direct leak of GDI objects as I could notice upon ensuring proper disposal of them. Since we are using tooltips on a certain kind of label, the correct move was to move the tooltip creation into a class inheriting from label and using the base Control’s disposing event.</p>\n<p> </p>\n<p>I hope that if you still answer the title question with yes, it is based on a couple of memory profiling sessions and the awareness of the ways .NET and GDI object leaks may come into live.</p>","frontmatter":{"date":"May 26, 2010","path":null,"title":"Do you think your Windows.Forms Application has no memory leaks?","tags":["software-development","dotnet","windows","csharp"]}}},"pageContext":{"title":"Do you think your Windows.Forms Application has no memory leaks?","previous":{"fields":{"slug":"/2010/05/22/assimilose"},"frontmatter":{"title":"Assimilose","tags":["loosely-coupled","geekdom"],"date":"2010/05/22"}},"next":{"fields":{"slug":"/2010/07/16/respond_to-in-net"},"frontmatter":{"title":"respond_to in .NET","tags":["ruby","csharp"],"date":"2010/07/16"}}}}