{"data":{"markdownRemark":{"html":"<p>I have to admit: I have not done much <a href=\"https://github.com/reactjs/redux\">redux</a> yet. My colleague has and I was able to help him at times and look over his shoulder. Redux is possibly the (<em>currently</em>) most popular implementation of the pattern coined as <strong>Flux</strong> by facebook. I wouldn't be surprised if people would call it reactive loop or something along those lines. At least you'll see me using this term ;)</p>\n<p>Whatever implementation you use, they will have in common the way in which the UI informs about user actions, a place to act upon those actions and a place to modify some kind of state which dictates the data and state of the UI on the next render pass.</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">UI -&gt; dispatch(a : Action) -&gt; **logic e.g. in Stores etc.** -&gt; New State -&gt; UI</code></pre></div>\n<p>I have been a big friend of the concept of Observables and the utilities built around them in the form of the Rx libraries since I got to know it on .NET. In js we get the functionality via <a href=\"https://github.com/Reactive-Extensions/RxJS\">rxjs</a>.</p>\n<p>For some time I wanted to see how I could use the power of observables to get a reactive loop going. I wanted to end up with the basic notion of an <em>application function</em> which has the following signature:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">(state, action) -&gt; new state</code></pre></div>\n<p>I have been working irregularly towards a prototype, at the end it got quite a bit more polished than that. You can find the current results at the <strong><a href=\"https://github.com/flq/reax\">reax repository at github</a></strong>.</p>\n<p>The core of the idea is that there is a state observable as well as an action observable.</p>\n<p>These two observables are zipped together and the resulting return value is fed back onto the state observable.</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">var allSyncStates = map(app.appFuncs, (appFunc) =&gt; {\n  return actionObservable\n    .filter(createAppFuncFilter(appFunc.selector))\n    .withLatestFrom(stateObservable,\n      (action, state) =&gt; { return { state, action } })\n    .map(wrapFuncWithErrorDispatch(appFunc.func, additionalContext));\n});</code></pre></div>\n<p>This is one of the hearts of the whole reax loop. Whenever a dispatch occurs (e.g. from within the UI), the action observable will produce a new element. It will be filtered depending on the action type (<em>simply its type property</em>) and then zipped with the latest element from the state observable. That is the one that provides the sequence of state changes, and to which e.g. react components are subscribed.</p>\n<p>This zipping together happens for all application functions that you provide. Due to the way how action and state are joined and due to the call within the <em>map</em> of the resulting observable, we can provide functions with exactly the signature I was desiring.</p>\n<p>Since we now have as many state observables as application functions, we need to merge them together. Thanks to rxjs, a straightforward operation:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">const stateStream = Observable.merge(allSyncStates.concat(allAsyncStates));</code></pre></div>\n<p>The async state providers need to be treated differently. Hence, the application functions are also treated differently, but they are allowed to return a promise which will eventually provide a state.</p>\n<p>To mitigate some of the problems that result in having functions providing state possibly after some other action may already have changed the state, the state parameter to the application functions is not the state object, but a function providing the state object.</p>\n<p>An additional change for convenience was to allow application functions the access to the dispatcher function with which new actions can be dispatched. This makes for the nice signature:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">(s, a, d) =&gt; ... //State, Action, Dispatcher</code></pre></div>\n<p>A logical progression for this project is the ability to dispatch Observables that will produce actions:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">d(Observable\n  .timer(200,200)\n  .take(COUNTER_START - s().counter)\n  .map(_ =&gt; ({ type: &#39;tick&#39;, increment: -1 })));</code></pre></div>\n<p>Finally there is the Observables-speciality that once an exception is thrown in some running observable, that particular instance is dead. There are ways to pick up but the easiest in the context of reax is to catch any exceptions arising from an application function and feed them back into the reactive loop in the form of an action with the type being <strong>\"error\"</strong> (See <code class=\"language-text\">wrapFuncWithErrorDispatch</code> above).</p>\n<p>The first level of the API follows the builder pattern. It allows to</p>\n<ul>\n<li>set the initial state</li>\n<li>add application functions (sync and async)</li>\n<li>add action sources (observables whose output will be dispatched as actions)</li>\n<li>add state refiners: methods with the signature s => s, which allow you to look at the state resulting from the call of application functions, possibly refine it, or simply monitor it.</li>\n</ul>\n<p>Here's an example from a test:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">const app = appBuilder()\n  .addAppFunc(&#39;foo&#39;, (s,a) =&gt; ({ count: s().count + 1 }))\n  .addStateRefinement(s =&gt; ({ count: s.count * 2 }))\n  .setInitialState({ count: 1 })\n  .build();\n\nlet {dispatchAction,getCurrentState} = appInit(app);\ndispatchAction(fooAct);\n// s1 (1) -&gt; refine -&gt; s2 (2) -&gt; foo -&gt; s3 (3) -&gt; refine -&gt; s4 (6)\nassert.equal(getCurrentState().count, 6);</code></pre></div>\n<p>The second level of the API provides the possibility to pass in functions to the builder based on conventions. Here you have a very simple undo module that will work.</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">function undoApp() {\n\n  const stateStack = [];\n\n  return {\n    onUndo(s,a,d) {\n      stateStack.pop(); // current\n      var last = stateStack.pop();\n      return last;\n    },\n    monitorState(s) {\n      stateStack.push(s);\n    }\n  }\n}\n\nconst app = appBuilder()\n  .addApp(undoApp)\n  .build();</code></pre></div>\n<p>The conventions are summarized quickly:</p>\n<ul>\n<li>Any function beginning with <em>\"on\"</em>, the remaining name will be camel-cased and the function will be registered for actions whose type-property equal the camel-cased name (<em>onUndo -> undo</em>).</li>\n<li>Any function that starts with <em>\"refine\"</em> or <em>\"monitor\"</em> will be registered as a state refiner.</li>\n</ul>\n<p>Up to here we have no dependency to React (much like redux), but rather a way to listen to actions/messages and pushing changes to a tracked state object.</p>\n<p>The second part of the project is heavily inspired by Redux in that we have</p>\n<ul>\n<li>A Connector React-component that is the home of the <em>app</em> as constructed by the app builder and which makes sure that the state changes are communicated to the React API.</li>\n<li>A connect method that can be called on React components and provides them access to the dispatch function and which allows to influence what kind of state the connected component gets to see. The code used here really is a copy of the <a href=\"https://github.com/reactjs/react-redux\">react-redux</a> code, stripped of code which I assume to be hardening :)</li>\n</ul>\n<p>A more complete example, inspired by the <a href=\"http://www.infoq.com/articles/no-more-mvc-frameworks\">launch</a> <a href=\"https://bitbucket.org/snippets/jdubray/9dgKp/sa-sample\">example</a> provided by <strong>Jean-Jacques Dubray</strong> can be found <a href=\"https://github.com/flq/reax/blob/master/samples/launch.js\">here</a>.</p>\n<p>Other things I would have to look at before I would say that this is definitely useful...</p>\n<ul>\n<li>Support for async app funcs, action providers and initial state in the high-level API.</li>\n<li>Support for a mount point for application functions belonging together (i.e. only seeing / updating a branch of the tree.)</li>\n<li>Looking into a compatibility layer to redux-based projects <em>(wouldn't it be nice to be able to use redux forms while still using reax for the reactive loop?)</em></li>\n</ul>\n<p>All in all I am relatively happy with the result. What I like is that the Observable powers are usually never too far away to be used. I am also happy with the way the reactive loop is set up, something that I find a little bit more daunting than it should be in redux. Lately I have been wondering whether the state that is used to render the UI is nothing more than a glorified global variable, but I suppose that this is a different story that should be told at another time.</p>","fields":{"slug":"/2016/02/25/codename-reax-redux-ish-appflow-rxjs-based"},"frontmatter":{"date":"February 25, 2016","path":null,"title":"codename reax - redux-ish appflow, rxjs-based","tags":["own-software","javascript","libs-and-frameworks","react"]}}},"pageContext":{"title":"codename reax - redux-ish appflow, rxjs-based","previous":{"fields":{"slug":"/2016/02/09/up-a-free","published":true},"frontmatter":{"title":"Up a Free","tags":["fsharp"],"date":"2016/02/09"}},"next":{"fields":{"slug":"/2016/02/28/on-the-fractal-nature-of-effort-estimates","published":true},"frontmatter":{"title":"On the fractal nature of effort estimates","tags":["software-development"],"date":"2016/02/28"}}}}