{"data":{"markdownRemark":{"html":"<p>Apologies for handling yesterday in such a short space, but Comp crashed, a thing unknown to me. </p>\n<p>Since our last land visit 2 days ago on Paidahoe the system does not function properly anymore, and it almost seems that all other problems are caused by that. Frankly, I need to sort that out or we will end up as something that isn't even comparable to minced meat. I have a suspicion that my Engineer Lareto has uploaded some dodgy update into Comp, he came back totally hammered the evening before we left, had been drinking too much sloshdub with a couple of other Frognas...or maybe he's taking revenge because of the madness chip. Anyway... </p>\n<p>Actually, all problems are caused by Comp being fussed, as Meta-travel is pretty much impossible without a computer. Although I have heard that some (Budists#not understood) say something different about travelling space. Maybe I should return to Earth and settle down in Tibet. Or maybe I should stop joking and carry on exploiting the people's dumbness. Anyhow, that was yesterday, and today is today, hoping that the watch is still ticking correctly. </p>\n<p>The predicted problems did in fact occur during this morning's Meta-session. The compensators started to make very irritating noises, something of a mixture between a muted trumpet and the singing of a canary. Fritiu said that the Computer wanted to express its ability to create art. She called the sound \"Ode to the Meta-Continuum\". Excuse if I call the Computer she. Yup, new behaviour, too. But I am as sure as the Earth's flat seen from inner point 7, that she's got a female character now. Well, basically she got a female voice now, makes it a female for me. We have tried to set it back to the default voice. We gave up after 2 hours. An Ode...I would laugh if it wouldn't mean that the probability of us dying during a Meta-session has risen at least by a factor of 20. My engineer had 3 consecutive heart attacks, not too bad for a Frognas. Well, I call it heart attack anyway. What do you say when you see a Frognas twitching with a frequency that blurs your sight , throwing his eyes all over the place? After he had collected himself he did manage to get us out of the Meta- spacetime 3 hours ago. Kinda speaks against the wicked Engineer theory. </p>\n<p>The problems with the compensator did throw us off course, thankfully in the right direction, which has helped us to catch on with the schedule. It seems the Ode found benevolent ears somewhere out there. Some scientists do indeed believe that there are beings living completely submersed in the Meta-Continuum. I find that ridiculous! How could the medium that ensures Meta-interaction hold life in itself? I guess I'm just too stupid for it, and frankly, I don't give a rat's fart on meta-interaction. I swing my fist and it cracks someone's nose. Chronologically. Right? It doesn't happen in the same moment, right? Or does it always happen, (hmrgh#not understood)? Crap! I am just happy that some nerd whose name I forgot managed to let that tiny Spacetime-Sphere follow the paths laid out in the meta-continuum by our beloved suns. Good. Makes me rich. One of those days...Sometimes one has to have luck, otherwise you …</p>","frontmatter":{"date":"July 12, 2006","path":null,"title":"Log Entry 2711.07.13","tags":["sci-fi"]}}},"pageContext":{"title":"Log Entry 2711.07.13"}}