{"data":{"markdownRemark":{"html":"<p>A few years ago, being an <em>\"enterprise developer\"</em>, I attended a meeting about the IT strategy up to ⌚2020. Here we heard about <strong>\"innovating by consolidating\"</strong>.</p>\n<p>I thought of this statement as a contradiction (I suspect I didn't voice my concerns back then, after all, I was on layer 6 of the organisation while the CTO was on layer 2 or 3). To me, innovating also means having the freedom to do things differently, being the rebel, thinking something else - quite the opposite of consolidating. <em>Innovating by consolidating</em> sounded to me like the decades old Cuban regime talking about revolution.</p>\n<p>Innovation is fickle company, too, as I had to learn last week.</p>\n<h2>The experiment week</h2>\n<p>Last year at <a href=\"https://aheadintranet.com\">ahead</a> we did about two experiment weeks, external activities and stories - both were quite successful and valuable to our customers and on one of them we have iterated quite a bit already. Naturally, we wanted to repeat the experience by bringing all team members to Basel and kick into high gear.</p>\n<p>We started off by writing all ideas that had been gathered in our <a href=\"https://www.prodpad.com/\">prodpad</a> instance, and doing some <a href=\"https://en.wikipedia.org/wiki/Dot-voting\">dot-voting</a> to get our contenders for the week. From lunchtime onwards we kind of gravitated towards an idea, and 2 hours later we had something that seemed shippable within the week's timeframe.</p>\n<p><strong><em>But nobody seemed really happy with it.</em></strong></p>\n<p>We decided to go on with those stories already planned and prioritised and rather expriment with the way we tackled stories and pulled work into the current development.</p>\n<h2>Get well soon!</h2>\n<p>It turns out that the sales pipeline is growing and more and more customers are convinced that our product can be useful for them. This is great! On the other hand we know that a number of areas, while working, are far from polished. <strong>We were reluctant to start something new</strong>.</p>\n<p><img src=\"/assets/xp-week1.png\" alt=\"xp week 1\"></p>\n<figcaption>By lunchtime everything on the left had been discarded.</figcaption>\n<p>If you look around the internet for a definition of innovation, you will find many different attempts at explaining it - <a href=\"https://www.ideatovalue.com/inno/nickskillicorn/2016/03/innovation-15-experts-share-innovation-definition/\">here's one page</a> giving a couple of definitions from people. My personal definition (subject to change) would be along the lines of</p>\n<blockquote>\n<p>An experiment that proved successful by providing value</p>\n</blockquote>\n<p>What I take away from that, um, <em>unexpected</em> start into the <em>experiment week</em> is that innovation can hardly be forced, and in order to walk unexpected alleys, your mind must be freed from the daily strive for incrementally creating value. I've come to understand that even brilliant people (and hence companies) can fail to innovate because they are too busy improving on those features that are already there.</p>\n<p>Improving is valuable. Consolidating is valuable. Innovation, too! However, it is the last one that may be the hardest to attain, especially as your products matures and finds those people who find it valuable.</p>\n<p>Would we consider this week a failure? <strong>Hell, no!</strong></p>\n<ul>\n<li>We can see now how to bring some elements of Kanban into our way of working</li>\n<li>We are almost done with a particularly boring feature which nonetheless slashes our customer onboarding time by a wide margin</li>\n<li>And, as always, it is great fun and very intensive to work in close proximity with all of your team members!</li>\n</ul>","fields":{"slug":"/2019/03/03/innovation-vs-improvement"},"frontmatter":{"date":"March 03, 2019","path":null,"title":"Innovation vs Improvement","tags":["software-development"]}}},"pageContext":{"title":"Innovation vs Improvement","previous":{"fields":{"slug":"/2019/02/24/writing-azure-functions-with-typescript"},"frontmatter":{"title":"Writing azure functions with typescript","tags":["web","azure","typescript"],"date":"2019/02/24"}},"next":{"fields":{"slug":"/2019/03/11/use-reacts-context-to-display-an-error-message-somewhere-else"},"frontmatter":{"title":"Use react's context to display an error message somewhere else","tags":["programming","javascript","react"],"date":"2019/03/11"}}}}