{"data":{"markdownRemark":{"html":"<p>Well, not at home, but on my work laptop. Since January I was virtualizing all of my projects, and when a colleague pointed to a blog entry about how <a href=\"http://www.vmware.com/products/beta/ws/\">VMWare Workstation 6 Beta</a> (fully supporting Windows Vista as host) could be <a href=\"http://4sysops.com/archives/disable-debug-mode-of-vmware-workstation-60-beta-%E2%80%93-the-solution-for-vista-users/\">taken out of its default debug-mode</a>, I thought that it should be fairly painless to change to Microsoft's new Operating System.</p>\n<p>Well, what can I say? It was fairly painless. As such, Vista is simply the next OS from Microsoft. It brings improvements on many fronts. Especially likeable after 30 hrs. of Vista:</p>\n<ul>\n<li>Windows Mobility Center: All the stuff that had to be brought into the box via IBM utilities now in one single place. Wireless configuration / activity, projector settings, etc. Good!</li>\n<li>SuperFetch: Firefox has never started that quick on any system of mine. I can only guess it's Vista's ability to use RAM as a cache much more aggresively by prefetching stuff that I commonly use.</li>\n</ul>\n<p>One funny issue is the missing Windows key on older IBM thinkpads (what a cute way of nagging your competitor at the user's cost...). IBM had a utility program to map a key to Windows (and in Vista you will want that key more than ever). <a href=\"http://www.randyrants.com/2006/07/sharpkeys_211.html\">SharpKeys </a>comes to the rescue - it is a small .NET application that will allow you to deform your keyboard mappings. That way, your right Ctrl key quickly becomes the Windows Key.</p>\n<p>Suffice to say, VMWare works well, all my projects still work - We can move on. Obviously it is early to say anything definitive, but as expected Vista will be a better companion than XP. It is somewhat heavier than XP in terms of performance, and so far it has missed out the in-built bluetooth controller - but all in all it is hard to understand what all the fuzz is about. Would I voluntarily plaster Linux on my laptop if I have this OS available? Not me, but I'm a Windows kid anyway. After <a href=\"http://en.wikipedia.org/wiki/GEOS_%288-bit_operating_system%29\">GEOS</a>, Windows was the first Graphical OS that I used. In other words, when <a href=\"http://www.crysis-game.com/\">Crysis </a>comes out I'm ready to get a new PC at home - with Vista installed on it.</p>","frontmatter":{"date":"March 10, 2007","path":null,"title":"Update to Vista - Check!","tags":["windows"]}}},"pageContext":{"title":"Update to Vista - Check!"}}