{"data":{"markdownRemark":{"html":"<p>Quite some time ago I wanted to write about this in the form of a <a href=\"/go/7\">Hesitan &#x26; Miracles</a> dialogue. Alas, it doesn't seem like these two guys will ever manage to get on with this matter, so I'll write here.</p>\n<p>And why not? I can write about anything that bothers me. As an example, it bothers me that people are unable to leave their dogmatic foundations and look out and beyond their well-defined viewpoint, formalities, terminologies and definitions.</p>\n<p>In this case we have on one side some people who say that evolution cannot account for the amazing life forms that we find on this planet. On the other hand we have people who say that evolution is a well-defined process which sufficiently accounts for all flying, crawling, walking, swimming and jumping things that have a serious knack for procreation.</p>\n<p>Personally, I would like to say the following: We have an intelligent creator and it is called Evolution.</p>\n<p>Quite difficult for Science is the implied purpose in stating the afore. In Science, it is difficult to look at purpose. We prefer to look at the mechanisms, but the purpose of the Universe? That is not science's business.</p>\n<p>However, in Engineering we certainly talk about purposes. After all, we are doing systems for humans, and they do purposeful things, don't they? We need to think about the purpose, the goal. (See also <a href=\"http://dannorth.net/2008/02/goal-oriented-vocabulary\">Dan North</a> on \"bottle opener\" vs. \"cap remover\")</p>\n<p>It is indeed something that can hinder progress e.g. in software development - the request, or requirement or the desired function, indeed the purpose of some system, is defined and refined without isolating it from the mechanisms, the \"how\". Applied to this case I would think that the Authority (using this word in Philip Pullman's \"His Dark Materials\"-sense) got the function right, but not how it is implemented, while biologists have thought quite a bit about the mechanism without thinking about its intention. </p>\n<p>Surely, from a scientist's point of view attesting purpose to nature's mechanisms is beyond anything one such is willing to encounter and account for - yet, from my point of view the intelligence of evolution is recognizable if we look purely at the implemented mechanisms.</p>\n<p>Let us do an incomplete check on intelligence for its intention and used mechanisms. One of intelligence's functions is arguably problem solving. On human terms we would already consider solving a single problem as requiring intelligence.\nOne may argue that Evolution is also set out to solve a problem (indeed, one that would not exist if Evolution wouldn't exist - a paradox with which we are well aquainted in modern product development).</p>\n<p>What is Evolution's problem then? I'd argue for \"survival\" since Evolution's intention seems to be to keep life alive. If you think that I am anthropomorphizing evolution consider that I am looking at intelligence at an abstract level. One may consider that the mechanisms of intelligence should not be regarded as human features a priori. Other aspects of nature may exert similar functions and behaviours that, on an abstract level, may be judged as intelligence.</p>\n<p>What about intelligence's ways to implement its goal? One way of humans to solve problems is via trial and error. Indeed this is the most recognized mechanism of evolution as well. Selective mutation essentially performs variations on its designs and survival performs a beautiful feedback loop in that successful variations will have a greater chance to multiply.\nHumans design procedures also quite often go through trial and error - and failure, of which there are enough examples in human designs as well as evolved species (just look for the extinct ones). This mechanism forms a great, if not the major part of our everyday problem solving, for much of our abilities on finding good designs is based on the evolutionary improvement of tools that we can use to perform trial and errors at great speed e.g. in simulations or in programming languages that encapsulate problem layouts in a few lines of text.</p>\n<p>The ability to memorize successful designs is also something that we share with Evolution. Through communication and its tools we perform what Evolution seems to be doing with the aid of Genes. Iterative improvements become possible because previous achievements are memorized and accessible.</p>\n<p>Us being a result of evolution and us evolving tools by which we evolve designs - this fractal nature, this self-similarity irrespective of scale of the applied mechanisms indicates that we should consider that a concept like intelligence may simply be far more general than the implementations that we see in our brilliant, and flawed, in our strong and fragile human minds.</p>","fields":{"slug":"/2008/02/25/evolutions-intelligence"},"frontmatter":{"date":"February 25, 2008","path":null,"title":"Evolution's intelligence","tags":["hesitan-and-miracles","biology"]}}},"pageContext":{"title":"Evolution's intelligence","previous":{"fields":{"slug":"/2008/01/30/javascript-ftw-or-whats-this-anyway"},"frontmatter":{"title":"Javascript FTW or what's 'this' anyway?","tags":["software-development","javascript"],"date":"2008/01/30"}},"next":{"fields":{"slug":"/2008/03/30/poetry-i"},"frontmatter":{"title":"Poetry I","tags":["loosely-coupled"],"date":"2008/03/30"}}}}