{"data":{"markdownRemark":{"html":"<blockquote>\n<p><strong><em>(partisan)</em> gerrymandering</strong><br>\nmanipulate the boundaries of\n(an electoral constituency) so as to favour one party or class.</p>\n</blockquote>\n<p>In case you've been wondering why a German starts trying to understand\nUS politics: It's a long story. Suffice to say that at this point I am\nnot enjoying the current political situation in the West <em>at all</em>. The majority\nof people is making it far too easy for those in power to stay there.\nHere's my attempt to understand one aspect of it: How a US law put into\nthe Consitution in good will has been subverted by new capabilities in modeling,\nstatistics and data analysis.</p>\n<p>To gain a first insight into <strong>redistricting</strong> I looked <a href=\"http://redistricting.lls.edu/where.php\">into the writings</a> of\n<a href=\"https://en.wikipedia.org/wiki/Justin_Levitt\">Professor Justin Levitt</a>.</p>\n<p>Here is a list of concepts I required clarification about:</p>\n<ul>\n<li><strong>Federal</strong> vs. <strong>State</strong> powers / laws.<br>\nFederal powers are those given to the US as a whole, while State powers refer to those\ngiven to each state. E.g. only federal powers allow to maintain an Army. The Federal Bureau\nof Investigation is an agency transcending states.</li>\n<li>\n<p>The <strong>US congress</strong> is a federal institution consisting of</p>\n<ul>\n<li><strong>The senate</strong>: 2 representatives from each state, appointed for 6 years</li>\n<li><strong>House of representatives</strong>: 435 people, representing the states in proportion to their\npopulation. Each representative comes from a single <strong>district</strong> (For the concept of <em>gerrymander</em> I will focus on\ncongressional districts).</li>\n</ul>\n</li>\n</ul>\n<p>For now it is enough to know that in order to drive legislation in the US, you need the congress.</p>\n<p>Going back to <strong>redistricting for congressional districts</strong> there is one hard rule:\nThe population should be <strong>evenly distributed over all districts</strong>.</p>\n<p>Here is a very small example that nonetheless explains how it works:\n<a href=\"https://fivethirtyeight.com/features/rig-the-election-with-math/\">Rig the election - with Math</a>. I have copied the layout over here.</p>\n<p><img src=\"/assets/gerrymander_setup.jpg\"></p>\n<p>Each square has the same amount of population, namely 1.\nThe striped ones are in the minority. The aim is now to set up the districts\nof 5 people each in a way that the striped squares get the majority of disricts.\n(When you get the district you get to send your representative to the Congress).\nNot sure whether there are more solutions, but here is mine:</p>\n<p><img src=\"/assets/gerrymander_solution.jpg\"></p>\n<p>Now compare the popularity versus the congressional districts won:</p>\n<p><img src=\"/assets/gerrymander_result.jpg\"></p>\n<p>Pretty impressive! As <a href=\"http://www.ams.org/samplings/feature-column/fc-2014-08\">described here</a> I have used the following techniques\nto favor the striped party.</p>\n<ul>\n<li>packing: Try to put the opponent's majority centres into single districts.</li>\n<li>cracking: spread a voting block over many districts</li>\n</ul>\n<p>Other helpful strategies seemed to be:</p>\n<ul>\n<li>Spreading out - Combine parts of voting blocks by making your district thin.</li>\n<li>Multiplying - Divide a strong voting block of yours such that you can win\nmore than one district with it.</li>\n</ul>\n<p>The above article also presents a number of measures that attempt to highlight\nwhether a district has been tampered with.</p>\n<p>As a final note I would like to point <a href=\"http://election.princeton.edu/2012/12/30/gerrymanders-part-1-busting-the-both-sides-do-it-myth/\">out a text from 2012</a> which outlines that\ngerrymandering has been done a lot more by the Republican party than the\nDemocrats.</p>\n<p>I am looking forward to seeing whether the US will be able to deal\nwith this unfair advantage, since popular vote majorities by the Democratic party\nwill otherwise mean nothing in upcoming elections.</p>","frontmatter":{"date":"January 18, 2017","path":null,"title":"An outsider's guide to gerrymandering","tags":["loosely-coupled","mathematics"]}}},"pageContext":{"title":"An outsider's guide to gerrymandering","previous":{"fields":{"slug":"/2017/01/03/auxerrois"},"frontmatter":{"title":"Auxerrois","tags":["stuff-we-like","loosely-coupled"],"date":"2017/01/03"}},"next":{"fields":{"slug":"/2017/01/27/2d-historization-in-a-graph-database"},"frontmatter":{"title":"2D-Historization in a graph database","tags":["software-development","patterns","programming","neo4j"],"date":"2017/01/27"}}}}