{"data":{"markdownRemark":{"html":"<h2>Greetings world!</h2>\n<p>I think that writing something on my blog after such a long time merits merry greetings.</p>\n<p>Much is happening in the world of IT and it is difficult to find the right tooling for doing certain tasks. You could say that we may be <em>masturbating</em> by trying to find new IT tools every 3 months. Then again, we are a very young industry with still a lot to learn. Solutions that we are using are far from perfect and maybe we are still part of the pioneer generation, those that have to figure out by trial and error what works and what doesnt in the world of bits of bytes.</p>\n<p>As an example, I have yet again changed my tooling with respect to my website. It now runs on <a href=\"http://fubu-project.org\">FubuMVC</a>, an open source web framework that pushes the limits on what you can do with the .NET framework with respect to composing your application with polished configuration APIs and runtime discovery of components and services. It is a framework that lets you move one level above the usual with regard to configuration. This metastage allows that a framework lets you define how your application composes itself. It has the ability to free your code from the clutches of an all-encompassing framework, but only time will tell if this is already \"too much\".</p>\n<p>Hence the Rf.Sites stack is now reimplemented with FubuMVC. I also ditched the XMlRPC-based implementation of the metaweblog API. In the world of REST etc. pp. et. al. it felt like an anachronism, a wart from times when you hung out in bars and didn't care how you looked the next morning. </p>\n<p><a href=\"https://github.com/flq/Rf.Sites\">Rf.Sites</a> now got its own API to be able to publish new posts. Incidentally it means that I can write blog posts with <a href=\"http://daringfireball.net/projects/markdown/\">markdown</a>, which is the way I like it these days. In case you haven't heard of markdown, do yourself a favor and have a look at it. After so many years the text editor is still ubiquitous, only the input devices change - As an example, I am writing this on an IPad, with the bluetooth keyboard I got from the MS Build conference. The file will end up on my laptop via dropbox and from there I will touch it up markdown style and send it to my website either with curl or with the markdown editor I am currently working on (<a href=\"https://github.com/flq/Thawmadoce\">thawmadoce</a> - the awesome markdown centrifuge).</p>\n<p>Truth be told, I like to fool myself that I was doing all this to streamline the process of publishing to a point where I would be doing it on a regular basis. </p>\n<p>However, more likely is the theory that I am a techie pioneer trying to figure out what works and what doesn't.</p>","frontmatter":{"date":"November 17, 2011","path":null,"title":"New Tooling, new Posts","tags":["software-development","loosely-coupled"]}}},"pageContext":{"title":"New Tooling, new Posts"}}