{"data":{"markdownRemark":{"html":"<p>Here &#x26; There I have been seeing people using Ruby's build system <a href=\"http://rake.rubyforge.org/\">rake</a> in their .NET open source projects instead of NAnt or MSBuild. </p>\n<p>I don't really feel like commenting this fact here, but it is slightly annoying that people expect us to know ruby and do not write a single line about the fact that their build system actually requires an environment that has nothing to do with .NET.</p>\n<p>Thankfully the last part is not quite true anymore. The Dynamic Language Runtime (DLR) is slowly coming into mainstream with the first <a href=\"http://www.microsoft.com/downloads/details.aspx?FamilyID=ee2118cc-51cd-46ad-ab17-af6fff7538c9&#x26;displaylang=en\">.NET 4.0 beta</a> made available.</p>\n<p>IronRuby is being developed to run on the DLR and there is already work to make it run <a href=\"http://ironruby.codeplex.com/Release/ProjectReleases.aspx?ReleaseId=27606\">with the 4.0 Beta</a>.</p>\n<p>Unfortunately, important dependencies are not part of this release such that my attempt to get rake running didn't work out.</p>\n<p>I tried it with the current <a href=\"http://www.ironruby.net/\">IronRuby</a> release. I suppose it doesn't make any use of the Beta 1 things of the 4.0 framework, but you can get the idea...\nIronruby makes rake available in the form of <em>irake</em>, and gem (the installer of libraries in ruby) as <em>igem</em>. In retrospect I am uncertain if I needed it, but I performed an igem install rake in order to call irake on the system.</p>\n<p>I tried the setup on Jeremy Miller's <a href=\"http://storyteller.tigris.org/\">storyteller</a> project, which contains a rake file for building. Once I removed a dependency in <em>BuildUtils.rb</em> to the module FileTest (which seems to exist in the ruby 1.9 core library, however I cannot really pinpoint it) the rake file walked through without issues. </p>\n<p>Armed with this setup you should be able to fend the latest fashion in .NET solution building!</p>","frontmatter":{"date":"June 01, 2009","path":null,"title":"Fashion of the week - Building with Rake","tags":["ruby","dotnet","libs-and-frameworks"]}}},"pageContext":{"title":"Fashion of the week - Building with Rake"}}