{"data":{"markdownRemark":{"html":"<p>One thing up front. <a href=\"http://oredev.org/2010\">This conference</a> may blow my mind. My neuronal network(s) will take a shift, for better or worse remains to be seen.</p>\n<p>Wednesday’s Keynote was held by <a href=\"http://www.drjeffnorris.com/\">Dr. Jeff Norris</a> about Vision, Risk and Commitment. Yes, it’s that easy.</p>\n<p>The first part dealt with Vision, starting off with an anecdote on Monks jolted by electric currents happening sometimes towards the end of 18th century (couldn’t find internet-based sources) followed by a run-down of the very interesting history of <a href=\"http://en.wikipedia.org/wiki/Alexander_Graham_Bell\">Alexander Graham Bell</a>, whose invention of the telephone thrashed any outlooks that the then successful Western Union telegraphing company had. Moral of the story: Failing to see the value in visions can kill your business. (Even worse, Western Union was apparently offered to buy a fully functional telephone with related patents, for what can only be described as peanuts, and flat out refused it).</p>\n<p>Messages on Risk were put across with the example of getting to the moon and how to actually achieve that. The defining moment of managing the feat was to propose that there cannot be a single spacecraft that would manage lifting off earth, landing on the moon, getting up again and re-entering Earth, but that the whole thing would have to be composed of several parts that would play a role during the different phases of the mission.</p>\n<p>This idea was originally proposed by <a href=\"http://en.wikipedia.org/wiki/John_Houbolt\">John Houbolt</a> and first opposed and later accepted by <a href=\"http://en.wikipedia.org/wiki/Wernher_von_Braun\">Werner von Braun</a>.  </p>\n<p>Some NASA rocket science was also put to good use by having a computer recognize some cards that Norris was shifting on the table and represent those on screen as Moon, Earth, Apollo landing module etc. Awesome!</p>\n<p><img src=\"/assets/10112010072_4e5578a4-83a2-4ccf-af5c-6a477dc987f5.jpg\" alt=\"10112010072\" title=\"10112010072\"> </p>\n<p> </p>\n<p>The main point to get across is that this massive change in concept enabled the NASA to land on the moon. The question needs to be asked not only about the cost of changing something but also <strong>the cost of not changing something</strong>.</p>\n<p>Derailed thought-train:</p>\n<p>How long can you stay uncommitted, considering the vast amount of options available? </p>\n<p>Would you think that life would still exist if Evolution would only consider the risk of changing something?</p>\n<p>The picture of all those doors you could walk through to achieve your goal reminded me of <a href=\"http://en.wikipedia.org/wiki/Quantum_electrodynamics\">QED</a> in a very weird way, but I don’t know the implications of that yet (if any).</p>\n<p>All in all, a damn good keynote.</p>","frontmatter":{"date":"November 10, 2010","path":null,"title":"&Oslash;redev keynote #1: NASA&rsquo;s Jeff Norris","tags":["oredev","software-development","loosely-coupled","geekdom"]}}},"pageContext":{"title":"&Oslash;redev keynote #1: NASA&rsquo;s Jeff Norris","previous":{"fields":{"slug":"/2010/10/11/useful-extension-methods-for-points-and-friends-in-wpf"},"frontmatter":{"title":"Useful Extension Methods for Points and friends in WPF","tags":["WPF","csharp","libs-and-frameworks"],"date":"2010/10/11"}},"next":{"fields":{"slug":"/2010/11/15/øredev-things-from-microsoft"},"frontmatter":{"title":"Øredev: Things from Microsoft","tags":["dotnet","csharp","oredev"],"date":"2010/11/15"}}}}