{"data":{"markdownRemark":{"html":"<p>Hopefully everybody who reads this knows more or less what Attributes are in terms of .NET/C# programming. While I was scanning the documentation for that interesting <a href=\"http://www.castleproject.org/monorail/index.html\">Monorail project</a> (btw, if you ever played with <a href=\"http://www.rubyonrails.org/\">RoR </a>you probably feel right at home), I noticed that you can also apply attributes to method parameters. In the following I develop a small example as to how you can make use of such a feat. First let's get the mockery behind us...</p>\n<pre><code class=\"language-csharp\">class Program {\n  static void Main(string[] args) {\n    Scientist s = new Scientist();\n    s.Promote(new Level(2));\n    Manager m = new Manager();\n    m.Promote(new Level(3));\n    Console.ReadLine();\n  }\n}\n\nclass Level {\n  int LevelID;\n  public Level(int lID) {\n    LevelID = lID;\n  }\n}\n\nclass CareerPathAttribute : Attribute {\n  public string PathID;\n\n  public CareerPathAttribute(string pID) {\n    PathID = pID;\n  }\n}\n</code></pre>\n<p>The <strong>Level</strong> class won't do much in our example, while the <strong>CareerPathAttribute</strong> will be applied to a parameter in the following fashion:</p>\n<pre><code class=\"language-csharp\">class Scientist : Person {\n  public override void Promote([CareerPath(\"Science\")] Level level) {\n    base.Promote(level);\n  }\n}\n\nclass Manager : Person {\n  public override void Promote([CareerPath(\"Management\")] Level level) {\n    base.Promote(level);\n  }\n}\n</code></pre>\n<p>As you can see, the attribute is written right before the method parameter and parameter type. While you haven't seen the <strong>Person</strong> class (yet), you will notice that the methods override an already defined one. It shows that definition of attributes do not affect the method signature (which makes sense, as the appliance of attributes is fully transparent from a runtime perspective, i.e. you don't call such a method any different than in the case where no attribute would be defined). </p>\n<p>Let us have a look at the <strong>Person</strong> class then...</p>\n<pre><code class=\"language-csharp\">abstract class Person {\n\n  public virtual void Promote(Level level) {\n    // Skipping the current frame, i.e. going to the caller\n    StackFrame sf = new StackFrame(1); \n    CareerPathAttribute a = FindAttribute&#x3C;CareerPathAttribute>(sf.GetMethod());\n    if (a != null)\n      Console.WriteLine(\"field has additional info: \" + a.PathID);\n  }\n\n  private static T FindAttribute&#x3C;T>(MethodBase mb) {\n    object[] o =\n      mb.GetParameters()[0].GetCustomAttributes(typeof(T), false);\n    return o.Length > 0 ? (T)o[0] : default(T);\n  }\n}\n</code></pre>\n<p>The inheriting classes then route their respective calls to <strong>Promote</strong> to the base class. The implementation there uses an interesting class called <strong>StackFrame</strong> from the <strong>System.Diagnostics</strong> namespace. It allows access to Reflection info from the point of view of the current stack . Here I use the constructor that allows to specify which frame to skip. In other words I am skipping the current frame, that is, the method I am in when calling \"<strong>GetMethod()</strong>\". The call to the <strong>FindAttribute</strong>-method then shows where you can actually find the attribute that you place on a method parameter - in the custom attributes of the <strong>ParameterInfo</strong> object. </p>\n<p>In other words, it is not in any way attached to the instance passed through as argument - which is logical. However, it means that in order to access the custom attribute you actually have to go to the method and parameter where the attribute is defined. This is the reason why I skipped one frame. I.e. I end up with the calling method - in this case blindly trusting that there is a calling method that has at least one parameter.</p>\n<p>The strategy illustrated here is admittedly not very convincing - The intent of this attribute means that it could have been placed on the calling method/field itself. However,  it shows that you can for example pass additional information to a base class with a little bit of runtime and reflection information in order to provide a further dimension of decision pointers to some underlying implementation.</p>","frontmatter":{"date":"December 02, 2007","path":null,"title":"Applying Attributes to method parameters","tags":["software-development","dotnet"]}}},"pageContext":{"title":"Applying Attributes to method parameters"}}