{"data":{"markdownRemark":{"html":"<p>What is a Bus?</p>\n<p>A bus carries people from A to B. That much is easy. You might have guessed that I am not in the transport business, nonetheless a bus in the software world also carries payloads around. You put something into the bus, expecting it to deliver your stuff to its designated destination. How it does that isn’t necessarily your business. Differing from the real business of public transportation you may not even care where your payload arrives.</p>\n<p>The notion of putting your payload into the bus is called <strong>publishing</strong>.</p>\n<p>You can attach your bus stop to the bus line. Normally you can specify which “passengers” you are interested in, and only those will come along to visit you. Other times you may interested in all “passengers” coming your way. Again, you do not necessarily care where your passengers come from, but you really wish they come in one piece and don’t get lost along the way.</p>\n<p>The notion of attaching to the bus line to expect passengers is called <strong>subscribing</strong>.</p>\n<p>A final word about the passengers. They are usually called <strong>messages</strong>, this time stealing the word from the world of mail delivery.</p>\n<p>There are plenty of buses around in .NET world, let’s name a few: <a href=\"http://www.nservicebus.com/\">NServiceBus</a>, <a href=\"http://masstransit-project.com/\">MassTransit</a> and <a href=\"http://www.microsoft.com/windowsazure/appfabric/\">.NET Service Bus</a>. They all cover different grounds – what can be said, though, is that they all help setting up applications that scale well in terms of performance and throughput. This is because the publisher and the subscriber aren’t connected much more than via the payload that moves along the bus line. In other words, there aren’t much guarantees given in terms of when exactly a message arrives at this destination. Such applications are designed to handle node failures, network latencies, peak loads and similar situations.</p>\n<p>MemBus is none of that. What <em>is</em> MemBus then?</p>\n<p>It is a <a href=\"http://github.com/flq/MemBus\">messaging framework available at github</a> and licensed under the Apache 2.0 license that utilizes the semantics of sending and receiving messages. Those messages are not meant to leave the AppDomain where the Bus lives in. There is no durability - when the AppDomain is gone, the Bus is gone.</p>\n<p>MemBus simply allows you to use the messaging paradigm while staying internal to your App. By the way, this concept has a lot of similarities to what people call <strong>Event Aggregator</strong>, however, I prefer to think of this pattern in a “bus/messaging”-way.</p>\n<p>As a final note to this introduction here’s the most simple code possible with MemBus:</p>\n <div style=\"padding-bottom: 0px; margin: 0px; padding-left: 0px; padding-right: 0px; display: inline; float: none; padding-top: 0px\" id=\"scid:812469c5-0cb0-4c63-8c15-c81123a09de7:e0bae41d-f35c-435b-a0de-b0c71e28e966\" class=\"wlWriterEditableSmartContent\"><pre name=\"code\" class=\"c#\">var bus = BusSetup.StartWith&lt;Conservative&gt;().Construct();\nusing (bus.Subscribe&lt;MessageA&gt;(Console.WriteLine))\n    bus.Publish(new MessageA());</pre></div>\n<p>The following posts will show you in what different ways you can setup MemBus in order to support different scenarios.</p>\n<div class=\"alert\">\n<ul>\n<li>\n<p><a href=\"/go/176\">Introducing MemBus: Constructing it</a> </p>\n<li>[Introducing MemBus: Construction Variants](/go/177) \n<li>[MemBus: A more complex rich client setup](/go/178) \n<li>[Membus: Performance considerations](/go/179) \n<li>[Using MemBus](/go/180) \n<li>[MemBus extension points](/go/181)\n<li>[MemBus: Using an IoC Container to provide subscribers](/go/183)</div>[![kick it on DotNetKicks.com](http://www.dotnetkicks.com/Services/Images/KickItImageGenerator.ashx?url=http%3a%2f%2frealfiction.net%2fgo%2f175)](http://www.dotnetkicks.com/kick/?url=http%3a%2f%2frealfiction.net%2fgo%2f175) [![Shout it](http://dotnetshoutout.com/image.axd?url=http%3A%2F%2Frealfiction.net%2Fgo%2F175)](http://dotnetshoutout.com/Introducing-MemBus-In-Memory-PublishSubscribe-Messaging)\n</li>\n</ul>","frontmatter":{"date":"August 24, 2010","path":null,"title":"Introducing MemBus: In-Memory Publish/Subscribe Messaging","tags":["software-development","dotnet","patterns","membus"]}}},"pageContext":{"title":"Introducing MemBus: In-Memory Publish/Subscribe Messaging"}}