{"data":{"markdownRemark":{"html":"<p>There is no doubt, virtual machines are very useful, considering the constant increase in resources available even on a laptop (Yeah, alright, I got a mobile 100GB harddisk now). Today, while trying to set up a simple FreeDOS-based machine I learned the following:</p>\n<ul>\n<li>For machines which don't have access to a USB stick or shares readily available, you can always mount a virtual harddisk into your host OS (much like a network share) with the freely downloadable <a href=\"http://www.vmware.com/download/ws/drivers_tools.html\">workstation disk mount</a>. Then you can just copy files right into the virtual machine's hard-disk. Only nag is that you can only mount while the appliance is powered off. If you want to power it again, you must first unmount the disk. Still, it came in handy.</li>\n<li>A nice collection of VMWare related tools can be found at <a href=\"http://chitchat.at.infoseek.co.jp/vmware/\">VM Back</a>. Seriously cool is the virtual floppy mount. Especially on my laptop, which doesn't have a floppy drive, I can mount whatever bootable floppy I wish. I quickly made myself a bootable floppy for partition magic as well as Norton Ghost (see next point).</li>\n<li>Changing a machine's virtual harddisk is as easy as moving around files. Using the following approach, changing the disk size of your virtual appliance becomes a pretty safe task: You can create a virtual machine with a harddisk having the size you are targetting. Then you simply attach the harddisk containing your source files as a second hard disk. Finally you can simply boot that VM with e.g. a Norton Ghost floppy (see last point). Here you can now simply duplicate the disk (you have an empty disk and the attached source disk. Once you're done you can simply exchange the harddisks on your original virtual appliance. This is all..just..neat!</li>\n</ul>","fields":{"slug":"/2006/12/11/things-i-learned-about-vm-machines-today"},"frontmatter":{"date":"December 11, 2006","path":null,"title":"Things I learned about VM Machines today","tags":["software-development","technology"]}}},"pageContext":{"title":"Things I learned about VM Machines today","previous":{"fields":{"slug":"/2006/10/09/gmails-correction-utility"},"frontmatter":{"title":"GMail's correction utility...","tags":["humour"],"date":"2006/10/09"}},"next":{"fields":{"slug":"/2007/01/22/state-design-pattern-simplified"},"frontmatter":{"title":"State design pattern, simplified?","tags":["software-development","download","dotnet"],"date":"2007/01/22"}}}}