{"data":{"markdownRemark":{"html":"<p>I should probably write about the facebook WCF wrapper <a href=\"http://realfiction.net/go/130\">as promised</a>, but since I am have been working my a... off on the frontend of things with the aid of WPF, I will write something about that instead.</p>\n<p>There is plenty of stuff to write but in this post I reflect upon an idea I had a few days ago. The whole thing is certainly inspired by Dan Crevier's fantastic job on outlining how a <a href=\"http://blogs.msdn.com/dancre/archive/2006/09/17/dm-v-vm-part-8-view-models.aspx\">decent WPF application architecture may look like</a> with the added bonus of a nicely laid out and documented WPF solution to download. Very helpful indeed!</p>\n<p>In his work, Dan explores how to use attached properties to enhance the functionality of XAML-Tree members. In his example he essentially does expensive web requests for data only when the items actually become visible to the user. That way my facebook client can also do expensive calls to the Facebook API only when necessary.</p>\n<p>Back to the idea. In my client you will have the ability to create Image Buckets which you can enrich with some metadata (like to what Web service you want to upload it, with what titles or tags or whatever - currently only facebook is supported :) - Since the user may want to stop in his actions and return later, I wanted to give the application the ability to persist state. The concept I pursued was to have an attached property that, when applied to an ItemsControl (like e.g. a ListBox) would persist the contents of the ItemsSource without much further ado. A reusable concept seemed appropriate since the ItemsSource will in a WPF application most likely point to actual Business Objects.</p>\n<p>The actual attached property is constructed analogously to Dan's Model activation property:</p>\n<pre><code class=\"language-csharp\">  /// &#x3C;summary>\n  /// Attached property that can be used on Itemscontrol elements to persist its ItemsSource\n  /// &#x3C;/summary>\n  public static class PersistControl {\n\n    static List&#x3C;ItemsControlPersistenceHandler> persistenceHandler = \n      new List&#x3C;ItemsControlPersistenceHandler>();\n\n    public static readonly DependencyProperty PersistProperty = \n      DependencyProperty.RegisterAttached(\n        \"Persist\", typeof(string), typeof(PersistControl),\n        new PropertyMetadata(new PropertyChangedCallback(OnNameGiven)));\n\n    public static string GetPersist(DependencyObject sender) {\n      return (string)sender.GetValue(PersistProperty);\n    }\n\n    public static void SetPersist(DependencyObject sender, string value) {\n      sender.SetValue(PersistProperty, value);\n    }\n\n    private static void OnNameGiven(DependencyObject dependencyObject, \n      DependencyPropertyChangedEventArgs e) {\n      ItemsControl element = dependencyObject as ItemsControl;\n      if (element == null) return;      \n      if (e.OldValue == null &#x26;&#x26; e.NewValue != null)\n        persistenceHandler.Add(\n          new ItemsControlPersistenceHandler((string)e.NewValue, element));\n    }\n  }\n</code></pre>\n<p>What happens is that when the property is used on a DependencyObject, an associated callback instantiates an object of type <strong>ItemsControlPersistenceHandler</strong> which we will get to know later. The value provided is simply a string that is used as a key for serialization/deserialization of any objects encountered in the ItemsSource of the DependencyObject (here an ItemsControl). This is how you then use it in XAML:</p>\n<pre><code>&#x3C;ListBox x:Name=\"ListOfBuckets\" ... local:PersistControl.Persist=\"buckets\"> ...\n</code></pre>\n<ul>\n<li>Serialization: Ignore events</li>\n<li>Observablecollection: shadow copy</li>\n<li>unloaded: not raised when window closes?!</li>\n</ul>","frontmatter":{"date":"September 27, 2007","path":null,"title":"Serializing close to the WPF things","tags":["dotnet","libs-and-frameworks"]}}},"pageContext":{"title":"Serializing close to the WPF things"}}