{"data":{"markdownRemark":{"html":"<p>Are you tired of null checks in your C# code? if (blahdiblah != null) ?\nThere are several ways out</p>\n<ul>\n<li>Code in a different language</li>\n<li>Live with it</li>\n<li>Put some guidance on your code like e.g. NotNull attributes to give devs guidelines when coding against some API of yours</li>\n<li>Make the idea of not having a value a first-class citizen in your code</li>\n</ul>\n<p>This post deals with the 4th point. My inspiration came from a brief look into F# and some coding with it. In there you can modify your type to be something like Option(Of T) instead of T. It says that there may be no value of type T, and your code must deal with that sort of thing:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">let att = x.GetCustomAttributes(true) |&gt; Seq.tryFind is&lt;TypeConverterAttribute&gt;\nmatch att with\n| Some(att) -&gt; Some(att |&gt; instantiateTypeConverter)\n| _ -&gt; None</code></pre></div>\n<p>So, instead of writing a method that may return null, you write a method that returns an Option, or Maybe of some type. Its structure is similar to the Nullable(Of T) in that you can ask a Maybe whether it contains a value and gives you access to the Value.</p>\n<p>An <a href=\"https://github.com/flq/XamlTags/blob/master/DynamicXaml/Extensions/Maybe.cs\">implementation of Maybe</a> can be found in my current pet project, DynamicXaml. The first version only worked for class types, but I found this rather limiting. While structs cannot point to nothing (since they don't point at all), the concept of not having a value is still useful for struct types (that's why Nullable is in place, D'oh!). Hence, the current implementation also takes structs. The standard constructor will say it has a value when the provided value deviates from <em>default(T)</em>'s response. You can override that by stating yourself whether you have a value or not.</p>\n<p>Also note that the current implementation is a struct, whose semantics are a good match to what a Maybe-<em>value</em> represents.</p>\n<p>Two extension methods allow quick transposition to the Maybe <em>\"type system\"</em> which work against class types and Nullable types.</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">int? x = null;\nMaybe&lt;int&gt; maybe = x.ToMaybe();\n\nstring y = &quot;&quot;;\nMaybe&lt;string&gt; maybe2 = y.ToMaybe();</code></pre></div>\n<p>Then comes <em>Get</em> and <em>Do</em> which covers a lot of ground in the Maybe domain, namely assigning and executing something. It allows you to write code similar to the following:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">_invokeMemberHandler.MaybeFirst(h =&gt; h.CanHandle(this)).Do(h =&gt; h.Handle(this));</code></pre></div>\n<p>See the MaybeFirst extension methods which works like FirstOrDefault from the LINQ namespace but returns a Maybe-value. All operations that occur within the Maybe domain essentially perform a side-effect when the Maybe value in question has a value. The side effect is the lambda you specify.</p>\n<p>In framework-type code, operations that check whether an object has certain properties seem to be quite common-place. For this, the Cast-extension methods appears to be rather useful. It tries to cast a <em>Maybe(Of T)</em> to a <em>Maybe(Of U)</em>. If the input has a value and can be cast to U, the resulting maybe contains a value.</p>\n<p>The following code uses yet another extension method that takes in an array of operations in the Maybe-Domain and execute them all until one operation returns a Maybe with a value:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">public static Maybe&lt;object[]&gt; NormalizeToBuiltXaml(this InvokeContext ctx, Func&lt;InvokeContext,object&gt; rootObjectSelector)\n{\n    var value = rootObjectSelector(ctx);\n\n    return value.Maybe(\n        v =&gt; v.Cast&lt;object[]&gt;(),\n        v =&gt; v.Cast&lt;Func&lt;XamlBuilder, Xaml&gt;&gt;()\n                .Get(func =&gt; func(ctx.Builder).Create())\n                .Get(obj =&gt; new[] { obj }),\n        v =&gt; v.Cast&lt;Func&lt;XamlBuilder, Xaml[]&gt;&gt;()\n                .Get(func =&gt; func(ctx.Builder))\n                .Get(xamls =&gt; xamls.Select(x =&gt; x.Create()).ToArray()),\n        v =&gt; v.Get(obj =&gt; new [] { obj })\n    );\n}</code></pre></div>\n<p>It is a normalization method that accepts a multitude of different input types and processes them to the same output type. See how natural the output is also a Maybe? If nothing matched, subsequent operations (side-effects) will not be executed.</p>\n<p>If you want to transpose back from the maybe-domain to the \"normal\" types, you can use the <em>MustHaveValue</em> extension methods. The standard one will throw an exception if there is no value, while the second takes a value that will be used as return if the maybe contains no value.</p>\n<p>As a final example, see the following code:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">public Maybe&lt;DataTemplate&gt; FindForType(Type type)\n{\n    return _interfaceTemplates.Get(type).Or(_root.FindFor(type));\n}\n\n// using...\npublic static Maybe&lt;U&gt; Get&lt;T,U&gt;(this IDictionary&lt;T,U&gt; dictionary, T key)\n{\n    U value;\n    var success = dictionary.TryGetValue(key, out value);\n    return new Maybe&lt;U&gt;(value, success);\n}</code></pre></div>\n<p>Compare this to</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">public DataTemplate FindForType(Type type)\n{\n    DataTemplate dt;\n    if (_interfaceTemplates.TryGetValue(type, out dt))\n      return dt;\n    return _root.FindFor(type); // Assuming this returns a DataTemplate\n}</code></pre></div>\n<p>While the standard write-up is also fairly readable, an API consumer still fails to see whether the return value may be null or not. </p>\n<p>And this may be the most important conclusion point of this incoherent end-of-year blog post. If you want to, you can make just about any implicit assumption of your code explicit. This one way here shows how the fact that there may not be a value available from an operation can be made <u>explicit</u>.</p>","frontmatter":{"date":"December 31, 2011","path":null,"title":"Tired of Null references? abolish them with Maybe","tags":["software-development","dotnet","patterns"]}}},"pageContext":{"title":"Tired of Null references? abolish them with Maybe","previous":{"fields":{"slug":"/2011/12/29/bulletin-on-planet-earth"},"frontmatter":{"title":"bulletin on planet earth","tags":["loosely-coupled","sci-fi"],"date":"2011/12/29"}},"next":{"fields":{"slug":"/2012/01/09/thawmadoce-screenshots"},"frontmatter":{"title":"Thawmadoce screenshots","tags":["software-development","own-software"],"date":"2012/01/09"}}}}