{"data":{"markdownRemark":{"html":"<h2>The participants</h2>\n<ul>\n<li>StructureMap</li>\n<li>A few human nitwits</li>\n</ul>\n<h2>The scene</h2>\n<ul>\n<li>An integration test</li>\n</ul>\n<p>Every once in a while objects that are instantiated together by your DI Container of choice don't match up in terms of life expectancy. What you can do, instead of taking some dependency on a service, you take a dependency on a <strong>Func(Of That Service)</strong> - the expectation being that every time you say <strong>service()</strong> you'll get a fresh instance of whatever is returned.</p>\n<p>After a row of refactoring (that's where the nitwit part comes in), the definition of a certain service registration looked like this:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">configurationExpression\n\t.For&lt;IFoo&gt;()\n\t.Use(ctx =&gt; new Foo(ctx.GetInstance&lt;IDependency&gt;, /* some other stuff */));</code></pre></div>\n<p>Note the subtle use of a method group where a Func is expected in <strong>Foo</strong>'s constructor.</p>\n<p>Tests were failing. First we found a bug in our code, then we found out that calling RavenDB's <strong>IDocumentSession.Dispose()</strong> <a href=\"https://groups.google.com/forum/?fromgroups#!topic/ravendb/Gmq2vCLu2m4\">does nothing</a>. We only found out because we realized that we were using the same document session over and over again. </p>\n<p>After some befuddlement it dawned on us that the method group based on StructureMap's context was the culprit. Turns out that this guy, once it has provided an instance for some requested type, it will fulfil subsequent requests from its private Cache. Whatever implements <em>IContext</em> in  the configuration lambda is not really meant to leave its natural boundary <em>inside</em> of the lambda. Interestingly, <strong>F#</strong> makes it harder to steal things off lambdas.</p>\n<h2>The morale of the story</h2>\n<ul>\n<li>Try not to steal instances that are provided to lambdas for the sole purpose of being used in there.</li>\n</ul>","frontmatter":{"date":"May 27, 2013","path":null,"title":"A knee-shot involving StructureMap, a closure and a leaking implementation detail","tags":["programming","dotnet"]}}},"pageContext":{"title":"A knee-shot involving StructureMap, a closure and a leaking implementation detail","previous":{"fields":{"slug":"/2013/04/25/words-you-should-avoid-if-youre-not-a-mathematician"},"frontmatter":{"title":"Words you should avoid if you're not a mathematician","tags":["loosely-coupled","mathematics"],"date":"2013/04/25"}},"next":{"fields":{"slug":"/2013/07/26/exploring-haskells-type-system-a-roman-number-type"},"frontmatter":{"title":"Exploring Haskell's type system - A Roman number type","tags":["programming","haskell"],"date":"2013/07/26"}}}}