{"data":{"markdownRemark":{"html":"<p>I am currently involved in product development with a small but fine team (4 devs, one product designer). We had to <em>redo</em> one of the core components in order to make it fit for its refined and renewed responsibilities. We did not see how we could work separately or even in pairs on this central junction of the application - the decision was made to go forward with <a href=\"http://mobprogramming.org\">mob programming</a> </p>\n<h4>how we did it</h4>\n<p>For about 2½ days we were sitting together. Each one brought their laptop along so that we didn't have to get used to someone else's dev environment. One was the \"driver\", typing what needs to be done and projecting the screen onto the Surface Hub. The others are the \"navigators\". We would set the time at 15 minutes for switching the driver, but we usually let the current \"step\" end before switching over. Switching over meant pushing to the branch, and the next one pulling and carrying on.</p>\n<h3>interesting precondition</h3>\n<p>We did not reinvent the component completely but had the previous incarnation to work with. That way it had characteristics of a code kata.</p>\n<h3>how did it turn out?</h3>\n<ul>\n<li><strong>Mob programming does not optimize for speed</strong> - while it is hard to put a number on this, subjectively it feels <em>slower</em> than working alone or in pair. There is simply more brain in the room and things need to be sorted out!</li>\n<li><strong>Mob programming optimizes for code soundness</strong> - With all people involved, the solution seemed to converge towards building what is necessary. Hence, there weren't masses of code involved but that which was written was absolutely <em>necessary</em>, <em>well named</em> and <em>sound</em>.</li>\n<li><strong>Mob programming optimizes for knowledge transfer and learning</strong> - You get to see how others write code and run their coding errands. Everybody makes an effort to understand what is happening (since everybody will be driver or navigator at some point). f something is unclear it will be asked straight away, then explained, or the question actually leads to code modifications with regard to naming and clarity. If everybody must understand the code, it must be pretty clear.</li>\n<li><strong>Mob programming optimizes for team flow and empathy</strong> - It provided a sense of shared accomplishment and generally \"good vibes\" in that the whole team sits in the same boat and everybody can peek into the other's mind.</li>\n</ul>\n<h3>would we do it again?</h3>\n<p>Yes, <strong>absolutely</strong>. I think there are many tasks that can be <em>done well</em> alone or in pair. But if you need a concerted effort that requires a number of changes and a lot of thinking, or possibly a situation where you introduce a new concept, this approach appears to make a lot of sense. But beware, though, that, at least for us, the mob programming days were <strong>absolutely exhausting</strong>. A lot of focus and zero distractions means that at the end of the day you are done!</p>\n<p>It's worth it, though, give it a spin if you get the chance.</p>","frontmatter":{"date":"March 25, 2018","path":null,"title":"Mob Programming - first impressions","tags":["software-development"]}}},"pageContext":{"title":"Mob Programming - first impressions","previous":{"fields":{"slug":"/2017/11/25/in-love-until-its-my-turn"},"frontmatter":{"title":"In love, until it's my turn","tags":["loosely-coupled"],"date":"2017/11/25"}},"next":{"fields":{"slug":"/2018/06/10/typescript-type-shenanigans-conditional-types"},"frontmatter":{"title":"Typescript type shenanigans: Conditional Types","tags":["programming","typescript","react"],"date":"2018/06/10"}}}}