{"data":{"markdownRemark":{"html":"<h2>From fiction to reality</h2>\n<p>Why would I ask visiting readers to question the borders between fiction and reality? As obvious as it appears to me that such limiting categorifications should be abolished in favour of more flexible terminology, as daunting it may appear to others. After all, living in an illusion with a high degree of decoherence to the set of things that are labelled 'real' by the majority of people is often a sure path to those homely places - you know, a sanatorium, where the nutcases <em>live</em>.</p>\n<p>Yet, when we look back at the development of the human race it becomes apparent that our achievements in terms of how we have changed the physical setting has been enabled by our mind's ability to analyse, modularise and draw conclusions up to the point where activities can be kicked off that ultimately lead to a substantial change to that very thing that we like to call reality.</p>\n<p>The process is empirically visible and becomes even more clear when we consider the spiritual knowledge accessible on this planet.</p>\n<p><strong>Fiction is a precursor to reality, it is a premise to drive reality away from an event-driven plan of action which we seemingly cannot influence to a projection of our plans onto physical reality.</strong></p>\n<p>Some of us may get cynical at this point, considering the idiocy behind some of our outlined paths from mere fiction over more and more concrete forms up to an actual realisation. However, I have only mused about the notion that there is a way from fiction to reality. The fact that the motivation to using this mechanism is often driven by our more primitive instincts (<em>I want this, if I can't have it, no one can, if it is my idea, it is good, if it doesn't affect me directly I need not care</em>, just to name a few) is indeed dangerous but does not need to constrain our understanding that the mechanism exists. As they say, <em>be careful about your wishes, they may become true</em>.</p>\n<p>What it also means is that</p>\n<p><strong>Fiction needs to be considered as just another degree of reality. It interacts with reality as much as feedback from the physical world influences our fictions.</strong> </p>\n<h2>From physics to spirituality</h2>\n<p>In my life that spans only 30 years I have already met numerous people and for me personally an important question that I like to pose is the simple \"Do you believe in God?\". The resulting answers are mixed, as you would expect when asking for things that are somewhat difficult to prove.</p>\n<p>To make it clear at this point:</p>\n<p><strong>The reality of the physical world is a minuscule part of a web of relations that spans far more concepts than the one that physics (encompassing all sciences focussed on the physical world) research has currently chosen to deal with.</strong> </p>\n<p>Why I have come to this conclusion would take us a bit far in this manifesto. However,  these days I would probably argue along the following line of thought:</p>\n<ul>\n<li>Would you consider humanity to be the climax of conscious life forms, the most sophisticated of them all?</li>\n<li>If not, isn't it quite easy to think that there may be far more advanced forms of consciousness than the ones we have to put up with?</li>\n<li>And if you follow this route, where will you end up? Without drawing a self-imposed limit, where will you end up?</li>\n<li>You may end up with a sum of all consciousness.</li>\n</ul>\n<p>Sums...they lead me to the following statement </p>\n<p><strong>Mathematics is a sufficient fundamental concept to all things from the mind's point of view. To count, to be able to differentiate by definition and to relate different objects to each other are the ingredients necessary to conquer the physical as well as the spiritual world from the mind's point of view.</strong></p>\n<p>I emphasise the mind's point of view. I have always been driven by my mind in the things I do. Even so, I must acknowledge that most spiritual masters insist that the mind can be a heavy burden when it comes down to experience reality. The biggest misunderstanding between science and spirituality may be that the one is mind driven while the other one is experience driven.</p>\n<p>To see what I am trying to express one can recommend e.g. \"Ancient wisdom\" by Anie Besant. For the uninitiated (like me) a somewhat confusing account of the planes of reality. However, its level of richness and detail as well as a high degree of comformity between many written accounts and shared experiences of spiritual masters are for me clear indicators towards understanding the physical plane as only one of many stages where the forces of love act.</p>\n<p> While schientists are (and must) be notoriously wary of their personal experience, spiritual masters have made their experience beyond the physical levels. At first sight hardly unifiable. But it will have to be done. Maybe on the base of love. </p>\n<h2>From realfiction to love</h2>\n<p>**The web of relations is driven and enlightened by energy. In a spiritual wordset this energy is called love. **</p>\n<p>This only means that realfiction is devoted to acknowledge the universal concept of love as being the unifying energy that relates all things to all other things. In plain words, this site strives for tolerance and understanding. It (tries to) distantiates itself from lack of love, which often expresses itself in cynicism, egoism, pessimism or attacking people that are different-minded, be it verbally or in its most disrespectful and condemnable form of physical violence.</p>\n<p>This does not mean that I may not verbally confront the reader with things that I consider to be typical results of lack of love (And, God, there are plenty these days). Just sometimes we have to be confronted with the bad things if we want to know what the good things are. If you now think that all this is terribly naive, then pause for a moment to consider what Jesus Christ stood for. While his influence may be wearing off in the last decades he is still an inspiration for millions of Christs after roughly two thousand years. And his message was simple and revolved around one simple thing. Acknowledging, accepting, admiring and focussing onto the universal force that many call love.  </p>","frontmatter":{"date":"May 28, 2006","path":null,"title":"The realfiction manifesto","tags":["site"]}}},"pageContext":{"title":"The realfiction manifesto","previous":{"fields":{"slug":"/2006/05/27/a-warm-welcome"},"frontmatter":{"title":"A warm welcome!","tags":["site"],"date":"2006/05/27"}},"next":{"fields":{"slug":"/2006/05/30/about-me"},"frontmatter":{"title":"About me","tags":["loosely-coupled","site"],"date":"2006/05/30"}}}}