{"data":{"markdownRemark":{"html":"<p>A colleague asked me why we didn't have a cure for the common cold <em>(I was telling him about the <a href=\"http://www.news.wisc.edu/22246\">complications of cold viruses</a>)</em>. I said something along the lines of us being more stupid than we think we are, and that quite often, teamwork won't work due to dysfunctional elements, hidden agendas and similar orthogonal noise.\nThen it occurred to me that we <em>also</em> became <strong>very impatient</strong>.</p>\n<p>The very first vaccine was developed <strong>1796</strong>. Sounds like an awful long time ago! It is 217 years. Roughly 20 solar cycles. You may witness about 7-10 in your lifetime. An olive tree could have grown maybe 3-4 metres. A continental plate may have moved 5-15 metres. 217 years are about <strong>0.009% of the total of human history</strong>.</p>\n<p>I have used my first mobile phone in <strong>1997</strong>. 16 years ago. If I'd have become a father back then, <strong>the kid would still go to school</strong>. My phone today does more than I could achieve with a PC 10 years ago.</p>\n<p>The near-instantaneous nature of our communications, the always-connectedness of our devices, the exponential growth of transistor counts on processors, of people on this planet and everything that goes with them may have lured us into a trap of selective bias - those entrapped are surprised if stuff doesn't change every year, if there is no technological <em>\"revolution\"</em> every 2 years. The very strong focussing on <strong>I</strong> also leads to a sense of desperation if things don't become considerably different/better/moar awesome in <strong>my</strong> lifetime.</p>\n<p>Most of the time the pace on this planet is <em>a lot slower</em>. Evolution requires hundreds to thousands of years to change some aspect of life. The growth of knowledge, the foundation of everything we are doing right now, has been comparable to a standstill for the most part of our history and has only accelerated in the last couple of generations. I once thought that we should be much more advanced than what we are, that we are not using our full potential. But we can't focus that way. Get 10 people in the room and focussing in a way that makes the best use of the available potential becomes a struggle.</p>\n<p>Unless you like to become depressed, <strong>there is no reason to be impatient</strong>. Things are generally slow, our lifetimes are nothing compared to the big changes that happen. If the only thing that we did is making this place a little bit more interesting, a little bit more advanced for our sons and daughters, we should be happy and relax and enjoy our stay.</p>","frontmatter":{"date":"November 11, 2013","path":null,"title":"We became impatient","tags":["loosely-coupled"]}}},"pageContext":{"title":"We became impatient","previous":{"fields":{"slug":"/2013/09/26/funspins-collisions-the-dead-and-a-not-so-grateful-ending"},"frontmatter":{"title":"FunSpIns - Collisions, the dead, and a (not so) grateful ending.","tags":["programming","haskell","fun-spin"],"date":"2013/09/26"}},"next":{"fields":{"slug":"/2013/12/10/c-6-language-features-5-cents"},"frontmatter":{"title":"C# 6 language features? 5 cents.","tags":["csharp"],"date":"2013/12/10"}}}}