{"data":{"markdownRemark":{"html":"<p>All spatial coordinates of our continuum (the reality in which we communicate right now) can have a type. <strong>Huh?</strong></p>\n<p>Well, indeed, the Ii have a model of Spacetime that could be regarded as subtantivalist, as opposed to a relational spacetime, where there is only space and time at the 'places' where actual observables are. Is this not heavily outdated, considering good old Isaac Newton believed in absolute space and time?\n<p>Well, the fun thing is, that Spacetime for the Ii is absolute. Or is it not? Well, the model caters for clearly defined spatial coordinates, however, the overall structure is defined by the relation of those coordinates to each other. Additionally, the enforcement of this structure is normally inaccessible to us - the following chapter on <strong>interaction frequency</strong> focusses on this phenomenon. Suffice to say that the Ii are able to consider an entity that in its essence is comparable to a single spatial point - Even so, due to its relations linking to and from it, it plays a completely different role. It keeps track of all of the relations between all spatial coordinates. It is the enabler for the ability of pure energy to flow from one space point to another. We shall refer to such entities in capital letters (like SPACE). </p>\n<p>This flow of energy is related to additional entities. One of those is TIME. This entity plays the simple role of providing a tact to other entities. Additional relations come from a number of entities that may be summarised as TYPE.</p>\n<p>Type encompasses all entities that shape the relationships that define the aforementioned energy flow. Such energy may and will be witnessed by us as particles (or whatever classical notion of something moving through space you prefer).</p>\n<p>Relating the idea of constraining entities and instance objects to space we now have for space the constraining entity SPACE, while the instance objects are the actual space points.\nWith o(n) being some space point and S the SPACE entity, a simple, unconstrained energy flow through such a system may flow like S -> o(1), o(1) -> S, S -> o(2), o(2) -> S, ...</p>\n<p>Now imagine that that flow of energy obtains additional constraints that influence the described flow. In terms of our Spacetime reality, the Ii call the sum of those constraining elements the types.</p>\n<p>From our perspective, a type is then a grouping of properties that directly influence how energy moves throughout our continuum over time. The properties that constitute a type are those that group the elementary particles according to their availability to different classical fundamental interactions. Those interactions are nothing but reality itself - that which can be reproducably experienced, observed and probed. As the Ii say, that which does not interact, does not exist.</p>\n<p>In order to interact purely within the confines of our continuum, a spatial object requires a type as it dictates the behaviour in relation to other <em>typed matter</em>. If we speak as an example about an electron, we could mean any electron. We use it as a label to describe matter with a specific type. 'ELECTRON', however, is an entity, a TYPE definition, while the electrons are typed matter, instance entities or objects (i.e. ready for classical interaction in spacetime). </p>\n<p>What properties exactly shape a type definition is not so important. While we may consider the charge and mass of  the electron in order to do some physical modelling, in other circumstances the electron's angular momentum is more relevant when trying to predict Spacetime interactions. For the Ii, the classification of matter as being typed or not is a specialised description of the world. Firstly, the notion of 'typedness' stems from the common interaction frequencies that typed matter shares and secondly it provides some terminology to describe spacetime without matter.</p>\n<p>The relational web of Spacetime (which is often referred to as <strong>4Band - continuum</strong> by the Ii, due to the fact that there is a frequency attached to the interactions based on said major entities which allows to speak of Bands when referring to the main observables of reality) goes hand-in-hand with type definitions - while normal matter could be seen as a combination of a spatial description with some type (its contract towards influencing the spacetime relationships), 'pure' spatial definition that does not enclose any type may also be called untyped matter. Surely one could argue that matter is typed space, but heck, consistent terminologies are difficult to translate into Sapiens lingo! :)\n</p>","frontmatter":{"date":"February 20, 2007","path":null,"title":"Type","tags":["sci-fi"]}}},"pageContext":{"title":"Type"}}