{"data":{"markdownRemark":{"html":"<p>A few years ago, being an <em>\"enterprise developer\"</em>, I attended a meeting about the IT strategy up to ⌚2020. Here we heard about <strong>\"innovating by consolidating\"</strong>.</p>\n<p>I thought of this statement as a contradiction (I suspect I didn't voice my concerns back then, after all, I was on layer 6 of the organisation while the CTO was on layer 2 or 3). To me, innovating also means having the freedom to do things differently, being the rebel, thinking something else - quite the opposite of consolidating. <em>Innovating by consolidating</em> sounded to me like the decades old Cuban regime talking about revolution.</p>\n<p>Innovation is fickle company, too, as I had to learn last week.</p>\n<h2>The experiment week</h2>\n<p>Last year at <a href=\"https://aheadintranet.com\">ahead</a> we did about two experiment weeks, external activities and stories - both were quite successful and valuable to our customers and on one of them we have iterated quite a bit already. Naturally, we wanted to repeat the experience by bringing all team members to Basel and kick into high gear.</p>\n<p>We started off by writing all ideas that had been gathered in our <a href=\"https://www.prodpad.com/\">prodpad</a> instance, and doing some <a href=\"https://en.wikipedia.org/wiki/Dot-voting\">dot-voting</a> to get our contenders for the week. From lunchtime onwards we kind of gravitated towards an idea, and 2 hours later we had something that seemed shippable within the week's timeframe.</p>\n<p><strong><em>But nobody seemed really happy with it.</em></strong></p>","fields":{"slug":"/2019/03/03/innovation-vs-improvement"},"frontmatter":{"date":"March 03, 2019","path":null,"title":"Innovation vs Improvement","tags":["software-development"]}}},"pageContext":{"title":"Innovation vs Improvement","previous":{"fields":{"slug":"/2019/02/24/writing-azure-functions-with-typescript"},"frontmatter":{"title":"Writing azure functions with typescript","tags":["web","azure","typescript"],"date":"2019/02/24"}},"next":null}}